

<!DOCTYPE html>
<html lang="cn">
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="Blog">
    <title>拓扑排序以及关键路径总结 | mrh929&#39;s home</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#x4EE5;&amp;#x53CA;&amp;#x5173;&amp;#x952E;&amp;#x8DEF;&amp;#x5F84;&amp;#x7684;&amp;#x603B;&amp;#x7ED3; &amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#xFF1A;&amp;#x9996;&amp;#x5148;&amp;#x7EA0;&amp;#x6B63;&amp;#x4E00;&amp;#x4E2A;&amp;#x8B">
<meta property="og:type" content="article">
<meta property="og:title" content="拓扑排序以及关键路径总结">
<meta property="og:url" content="http://mrh1s.top/2018/12/06/e6-8b-93-e6-89-91-e6-8e-92-e5-ba-8f-e4-bb-a5-e5-8f-8a-e5-85-b3-e9-94-ae-e8-b7-af-e5-be-84-e6-80-bb-e7-bb-93/index.html">
<meta property="og:site_name" content="mrh929&#39;s home">
<meta property="og:description" content="&amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#x4EE5;&amp;#x53CA;&amp;#x5173;&amp;#x952E;&amp;#x8DEF;&amp;#x5F84;&amp;#x7684;&amp;#x603B;&amp;#x7ED3; &amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#xFF1A;&amp;#x9996;&amp;#x5148;&amp;#x7EA0;&amp;#x6B63;&amp;#x4E00;&amp;#x4E2A;&amp;#x8B">
<meta property="og:locale" content="cn">
<meta property="og:updated_time" content="2019-05-03T06:19:59.674Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="拓扑排序以及关键路径总结">
<meta name="twitter:description" content="&amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#x4EE5;&amp;#x53CA;&amp;#x5173;&amp;#x952E;&amp;#x8DEF;&amp;#x5F84;&amp;#x7684;&amp;#x603B;&amp;#x7ED3; &amp;#x62D3;&amp;#x6251;&amp;#x6392;&amp;#x5E8F;&amp;#xFF1A;&amp;#x9996;&amp;#x5148;&amp;#x7EA0;&amp;#x6B63;&amp;#x4E00;&amp;#x4E2A;&amp;#x8B">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "mrh929",
  "url": "http://mrh1s.top"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>mrh929&#39;s home</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">mrh929</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item">
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-e6-8b-93-e6-89-91-e6-8e-92-e5-ba-8f-e4-bb-a5-e5-8f-8a-e5-85-b3-e9-94-ae-e8-b7-af-e5-be-84-e6-80-bb-e7-bb-93" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    拓扑排序以及关键路径总结
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <p>  &#x62D3;&#x6251;&#x6392;&#x5E8F;&#x4EE5;&#x53CA;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x603B;&#x7ED3; <strong>&#x62D3;&#x6251;&#x6392;&#x5E8F;&#xFF1A;&#x9996;&#x5148;&#x7EA0;&#x6B63;&#x4E00;&#x4E2A;&#x8BFB;&#x97F3;&#x95EE;&#x9898;&#xFF1A;&#x62D3;&#x6251;(tuopu)&#x8BDD;&#x8BF4;&#x6211;&#x597D;&#x51E0;&#x6B21;&#x90FD;&#x8BFB;&#x6210;(tabu) (tuobu)&#x597D;&#x5417;&#xFF01;</strong> <strong>      &#x62D3;&#x6251;&#x6392;&#x5E8F;&#x662F;&#x9488;&#x5BF9;AOV&#x56FE;&#xFF08;&#x5373;&#x6709;&#x5411;&#x65E0;&#x8FB9;&#x56FE;&#xFF0C;&#x4E14;&#x56FE;&#x4E2D;&#x4E0D;&#x5141;&#x8BB8;&#x73AF;&#x7684;&#x5B58;&#x5728;&#xFF09;&#x7684;&#x4E00;&#x79CD;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x7528;&#x4E8E;&#x5C06;&#x4E00;&#x4E2A;AOV&#x56FE;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x6392;&#x6210;&#x7EBF;&#x6027;&#x5E8F;&#x5217;</strong> <strong>       &#x57FA;&#x672C;&#x64CD;&#x4F5C;&#x5982;&#x4E0B;&#xFF1A;</strong> <strong>1.&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5165;&#x5EA6;</strong> <strong>2.&#x6BCF;&#x6B21;&#x627E;&#x5230;&#x5165;&#x5EA6;&#x4E3A;&#x96F6;&#x7684;&#x70B9;&#x5165;&#x6808;&#xFF0C;&#x5E76;&#x5C06;&#x4E0E;&#x4E4B;&#x76F8;&#x8FDE;&#x7684;&#x8282;&#x70B9;&#x5165;&#x5EA6;&#x51CF;&#x4E00;</strong> <strong>3.&#x91CD;&#x590D;2&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x6808;&#x4E3A;&#x7A7A;</strong> <strong>4.&#x5224;&#x65AD;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x5C11;&#x4E8E;n&#x6B21;&#x5219;&#x6709;&#x73AF;&#xFF0C;&#x5426;&#x5219;&#x8F93;&#x51FA;&#x62D3;&#x6251;&#x5E8F;&#x5217;</strong> &#x5BB6;&#x8C31;&#x6811; &#x3010;&#x95EE;&#x9898;&#x63CF;&#x8FF0;&#x3011; &#x6709;&#x4E2A;&#x4EBA;&#x7684;&#x5BB6;&#x65CF;&#x5F88;&#x5927;&#xFF0C;&#x8F88;&#x5206;&#x5173;&#x7CFB;&#x5F88;&#x6DF7;&#x4E71;&#xFF0C;&#x8BF7;&#x4F60;&#x5E2E;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#x3002; &#x7ED9;&#x51FA;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5B69;&#x5B50;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x4F7F;&#x5F97;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x540E;&#x8F88;&#x90FD;&#x6BD4;&#x90A3;&#x4E2A;&#x4EBA;&#x540E;&#x5217;&#x51FA;&#x3002; &#x3010;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#x3011; &#x7B2C;1&#x884C;&#x4E00;&#x4E2A;&#x6574;&#x6570;N&#xFF08;1&lt;=N&lt;=100&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x5BB6;&#x65CF;&#x7684;&#x4EBA;&#x6570;&#x3002; &#x63A5;&#x4E0B;&#x6765;N&#x884C;&#xFF0C;&#x7B2C;I&#x884C;&#x63CF;&#x8FF0;&#x7B2C;I&#x4E2A;&#x4EBA;&#x7684;&#x513F;&#x5B50;&#x3002; &#x6BCF;&#x884C;&#x6700;&#x540E;&#x662F;0&#x8868;&#x793A;&#x63CF;&#x8FF0;&#x5B8C;&#x6BD5;&#x3002; &#x3010;&#x8F93;&#x51FA;&#x683C;&#x5F0F;&#x3011; &#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x5E8F;&#x5217;&#xFF0C;&#x4F7F;&#x5F97;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x540E;&#x8F88;&#x90FD;&#x6BD4;&#x90A3;&#x4E2A;&#x4EBA;&#x540E;&#x5217;&#x51FA;&#x3002; &#x5982;&#x679C;&#x6709;&#x591A;&#x89E3;&#x8F93;&#x51FA;&#x4EFB;&#x610F;&#x4E00;&#x89E3;&#x3002; &#x3010;&#x8F93;&#x5165;&#x6837;&#x4F8B;&#x3011; 5 0 4 5 1 0 1 0 5 3 0 3 0 &#x3010;&#x8F93;&#x51FA;&#x6837;&#x4F8B;&#x3011; 2 4 5 3 1</p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAX=10000;
int first[MAX],nxt[MAX],go[MAX],arcnum=1;
int rd[MAX],stack[MAX],top;
void addarc(int a,int b){
    nxt[arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum++]=b;
}

int main()
{
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,m;
    scanf(&quot;%d&quot;,&amp;n);
    for(int i=1;i&lt;=n;i++)
        while(scanf(&quot;%d&quot;,&amp;m)!=EOF &amp;&amp;m!=0)
            addarc(i,m),rd[m]++;
    for(int i=1;i&lt;=n;i++)
        if(rd[i]==0)
            stack[++top]=i;
    do{
        int now=stack[top--];
        printf(&quot;%d &quot;,now);
        for(int p=first[now];p!=0;p=nxt[p]){
            rd[go[p]]--;
            if(rd[go[p]]==0)
                stack[++top]=go[p];
        }
    }while(top!=0);


    return 0;
}
</code></pre><p><strong>&#x8BE5;&#x9898;&#x662F;&#x660E;&#x663E;&#x7684;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x9898;&#xFF0C;&#x6309;&#x7167;&#x6807;&#x51C6;&#x683C;&#x5F0F;&#x5199;&#x7A0B;&#x5E8F;&#x5373;&#x53EF;</strong>  <strong>&#x5956;&#x91D1;</strong> &#xFF08;<a href="http://fzoj.xndxfz.com/JudgeOnline/problem.php?id=1624&#xFF09;" target="_blank" rel="noopener">http://fzoj.xndxfz.com/JudgeOnline/problem.php?id=1624&#xFF09;</a> <strong>&#x63CF;&#x8FF0;</strong> &#x7531;&#x4E8E;&#x65E0;&#x654C;&#x7684;&#x51E1;&#x51E1;&#x5728;2005&#x5E74;&#x4E16;&#x754C;&#x82F1;&#x4FCA;&#x5E05;&#x6C14;&#x7537;&#x603B;&#x51B3;&#x9009;&#x4E2D;&#x80DC;&#x51FA;&#xFF0C;Yali Company&#x603B;&#x7ECF;&#x7406;Mr.Z&#x5FC3;&#x60C5;&#x597D;&#xFF0C;&#x51B3;&#x5B9A;&#x7ED9;&#x6BCF;&#x4F4D;&#x5458;&#x5DE5;&#x53D1;&#x5956;&#x91D1;&#x3002;&#x516C;&#x53F8;&#x51B3;&#x5B9A;&#x4EE5;&#x6BCF;&#x4E2A;&#x4EBA;&#x672C;&#x5E74;&#x5728;&#x516C;&#x53F8;&#x7684;&#x8D21;&#x732E;&#x4E3A;&#x6807;&#x51C6;&#x6765;&#x8BA1;&#x7B97;&#x4ED6;&#x4EEC;&#x5F97;&#x5230;&#x5956;&#x91D1;&#x7684;&#x591A;&#x5C11;&#x3002;&#x4E8E;&#x662F;Mr.Z&#x4E0B;&#x4EE4;&#x53EC;&#x5F00;m&#x65B9;&#x4F1A;&#x8C08;&#x3002;&#x6BCF;&#x4F4D;&#x53C2;&#x52A0;&#x4F1A;&#x8C08;&#x7684;&#x4EE3;&#x8868;&#x63D0;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x89C1;&#xFF1A;&#x201C;&#x6211;&#x8BA4;&#x4E3A;&#x5458;&#x5DE5;a&#x7684;&#x5956;&#x91D1;&#x5E94;&#x8BE5;&#x6BD4;b&#x9AD8;&#xFF01;&#x201D;Mr.Z&#x51B3;&#x5B9A;&#x8981;&#x627E;&#x51FA;&#x4E00;&#x79CD;&#x5956;&#x91D1;&#x65B9;&#x6848;&#xFF0C;&#x6EE1;&#x8DB3;&#x5404;&#x4F4D;&#x4EE3;&#x8868;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x4E14;&#x540C;&#x65F6;&#x4F7F;&#x5F97;&#x603B;&#x5956;&#x91D1;&#x6570;&#x6700;&#x5C11;&#x3002;&#x6BCF;&#x4F4D;&#x5458;&#x5DE5;&#x5956;&#x91D1;&#x6700;&#x5C11;&#x4E3A;100&#x5143;&#x3002; <strong>&#x8F93;&#x5165;</strong> &#x7B2C;&#x4E00;&#x884C;&#x4E24;&#x4E2A;&#x6574;&#x6570;n,m&#xFF0C;&#x8868;&#x793A;&#x5458;&#x5DE5;&#x603B;&#x6570;&#x548C;&#x4EE3;&#x8868;&#x6570;&#xFF1B;&#x4EE5;&#x4E0B;m&#x884C;&#xFF0C;&#x6BCF;&#x884C;2&#x4E2A;&#x6574;&#x6570;a,b&#xFF0C;&#x8868;&#x793A;&#x67D0;&#x4E2A;&#x4EE3;&#x8868;&#x8BA4;&#x4E3A;&#x7B2C;a&#x53F7;&#x5458;&#x5DE5;&#x5956;&#x91D1;&#x5E94;&#x8BE5;&#x6BD4;&#x7B2C;b&#x53F7;&#x5458;&#x5DE5;&#x9AD8;&#x3002; &#x8F93;&#x51FA; &#x82E5;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x5408;&#x7406;&#x65B9;&#x6848;&#xFF0C;&#x5219;&#x8F93;&#x51FA;&#x201C;Poor Xed&#x201D;&#xFF1B;&#x5426;&#x5219;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x6570;&#x8868;&#x793A;&#x6700;&#x5C11;&#x603B;&#x5956;&#x91D1;&#x3002; <strong>&#x6837;&#x4F8B;&#x8F93;&#x5165;</strong> 2 1 1 2 <strong>&#x6837;&#x4F8B;&#x8F93;&#x51FA;</strong> 201 <strong>&#x63D0;&#x793A;</strong> 80&#xFF05;&#x7684;&#x6570;&#x636E;&#x6EE1;&#x8DB3;n&lt;=1000&#xFF0C;m&lt;=2000&#xFF1B;100&#xFF05;&#x7684;&#x6570;&#x636E;&#x6EE1;&#x8DB3;n&lt;=10000&#xFF0C;m&lt;=20000&#x3002; <strong>&#x6B64;&#x9898;&#x6BD4;&#x4E0A;&#x4E00;&#x9898;&#x591A;&#x52A0;&#x5165;&#x4E86;&#x70B9;&#x7684;&#x6743;&#x503C;</strong> <strong>&#x4E5F;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x62D3;&#x6251;&#x5E8F;&#x5217;&#x4E2D;&#x6743;&#x503C;&#x548C;&#x6700;&#x5C0F;&#x662F;&#x591A;&#x5C11;</strong> <strong>&#x6807;&#x51C6;&#x505A;&#x6CD5;&#xFF1A;&#x4F7F;&#x7528;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#xFF0C;&#x5728;&#x53BB;&#x6389;&#x67D0;&#x4E2A;&#x70B9;&#x540E;&#xFF0C;&#x904D;&#x5386;&#x5B83;&#x7684;&#x76F8;&#x8FDE;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x8BA1;&#x7B97;&#x8BE5;&#x70B9;&#x7684;&#x6743;&#x503C;&#xFF0C;&#x662F;&#x5728;(val[v],val[u]+1),&#x5176;&#x4E2D;u&#x4E3A;&#x8D77;&#x70B9;&#xFF0C;v&#x4E3A;&#x4E2D;&#x70B9;&#xFF0C;&#x4E2D;&#x53D6;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x5F00;&#x59CB;&#x6211;&#x7684;&#x7406;&#x89E3;&#x51FA;&#x73B0;&#x7684;&#x504F;&#x5DEE;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x90A3;&#x4E2A;&#x70B9;&#x5165;&#x5EA6;&#x4E3A;0&#x7684;&#x65F6;&#x5019;&#x624D;&#x8BA1;&#x7B97;&#x90A3;&#x4E2A;&#x70B9;&#x7684;&#x6743;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x4E2A;&#x70B9;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x6761;&#x4EF6;&#x662F;&#x6BD4;&#x5B83;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x70B9;&#x6743;&#x503C;&#x90FD;&#x8981;&#x5C0F;</strong></p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAX=300000;
int first[MAX],nxt[MAX],go[MAX],arcnum=1,rd[MAX];
int stack[MAX],val[MAX],top;
void addarc(int a,int b){
    nxt[arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum++]=b;
}
int main()
{
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,m,a,b,k=0,tot=0;
    scanf(&quot;%d%d&quot;,&amp;n,&amp;m);
    for(int i=1;i&lt;=m;i++){
        scanf(&quot;%d%d&quot;,&amp;a,&amp;b);
        addarc(b,a);//b&#x6BD4;a&#x5DE5;&#x8D44;&#x4F4E; 
        rd[a]++;//&#x5165;&#x5EA6;+1 
    }
    for(int i=1;i&lt;=n;i++)
        if(rd[i]==0)//&#x5C06;&#x5165;&#x5EA6;&#x4E3A;0&#x7684;&#x70B9;&#x5165;&#x6808; 
            stack[++top]=i;
    while(top!=0){
        int now=stack[top--];//&#x5F53;&#x524D;&#x70B9; 
        k++; tot+=100+val[now]; 
        for(int p=first[now];p!=0;p=nxt[p]){
            val[go[p]]=max(val[go[p]],val[now]+1);//&#x4E0D;&#x5E94;&#x5F53;&#x5728;&#x5165;&#x5EA6;&#x4E3A;0&#x65F6;&#x624D;&#x66F4;&#x65B0;val[]&#xFF0C;&#x800C;&#x5E94;&#x5F53;&#x6BCF;&#x6B21;&#x90FD;&#x66F4;&#x65B0;&#xFF0C;&#x53D6;&#x6700;&#x5927;&#x503C; 
            if(--rd[go[p]]==0)
                stack[++top]=go[p];
            }
    }

    if(k==n) printf(&quot;%d&quot;,tot);
    else printf(&quot;Poor Xed&quot;);


    return 0;

}
</code></pre><p><strong>fzoj1621:&#x70E6;&#x4EBA;&#x7684;&#x5E7B;&#x706F;&#x7247;</strong> <strong>&#x9898;&#x76EE;&#x63CF;&#x8FF0;</strong> &#x674E;&#x6559;&#x6388;&#x4E8E;&#x4ECA;&#x5929;&#x4E0B;&#x5348;&#x505A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x6F14;&#x8BB2;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x4ED6;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7231;&#x6574;&#x6D01;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x628A;&#x81EA;&#x5DF1;&#x505A;&#x6F14;&#x8BB2;&#x8981;&#x7528;&#x7684;&#x5E7B;&#x706F;&#x7247;&#x968F;&#x4FBF;&#x5806;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6F14;&#x8BB2;&#x4E4B;&#x524D;&#x4ED6;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x6574;&#x7406;&#x8FD9;&#x4E9B;&#x5E7B;&#x706F;&#x7247;&#x3002;&#x505A;&#x4E3A;&#x4E00;&#x4E2A;&#x8BB2;&#x6C42;&#x6548;&#x7387;&#x7684;&#x5B66;&#x8005;&#xFF0C;&#x4ED6;&#x5E0C;&#x671B;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x5B8C;&#x6210;&#x5B83;&#x3002;&#x60C5;&#x51B5;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6559;&#x6388;&#x8FD9;&#x6B21;&#x6F14;&#x8BB2;&#x4E00;&#x5171;&#x8981;&#x7528;n&#x5F20;&#x5E7B;&#x706F;&#x7247;&#xFF08;n&lt;=26&#xFF09;&#xFF0C;&#x8FD9;n&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x6309;&#x7167;&#x6F14;&#x8BB2;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x987A;&#x5E8F;&#x5DF2;&#x7ECF;&#x7528;&#x6570;&#x5B57;1&#xFF0C;2&#xFF0C;&#x2026;&#xFF0C;n&#x5728;&#x4E0A;&#x9762;&#x7F16;&#x4E0A;&#x4E86;&#x53F7;&#x3002;&#x56E0;&#x4E3A;&#x5E7B;&#x706F;&#x7247;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4E00;&#x4E0B;&#x5B50;&#x770B;&#x6E05;&#x6BCF;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5E7B;&#x706F;&#x7247;&#x3002; &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7528;&#x5927;&#x5199;&#x5B57;&#x6BCD;A&#xFF0C;B&#xFF0C;C&#xFF0C;&#x3002;&#x3002;&#x3002;&#x518D;&#x6B21;&#x628A;&#x5E7B;&#x706F;&#x7247;&#x4F9D;&#x6B21;&#x7F16;&#x53F7;&#x3002;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x628A;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x6570;&#x5B57;&#x7F16;&#x53F7;&#x548C;&#x5B57;&#x6BCD;&#x7F16;&#x53F7;&#x5BF9;&#x5E94;&#x8D77;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x79CD;&#x5BF9;&#x5E94;&#x5E94;&#x8BE5;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF1B;&#x82E5;&#x51FA;&#x73B0;&#x591A;&#x79CD;&#x5BF9;&#x5E94;&#x7684;&#x60C5;&#x51B5;&#x6216;&#x662F;&#x67D0;&#x4E9B;&#x6570;&#x5B57;&#x7F16;&#x53F7;&#x548C;&#x5B57;&#x6BCD;&#x5BF9;&#x5E94;&#x4E0D;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x79F0;&#x5BF9;&#x5E94;&#x662F;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x3002; <strong>&#x8F93;&#x5165;</strong> &#x7B2C;&#x4E00;&#x884C;&#xFF1A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6570;n&#xFF0C;&#x8868;&#x793A;&#x6709;n&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x7684;n&#x884C;&#xFF1A;&#x5305;&#x62EC;4&#x4E2A;&#x6574;&#x6570;Xmin&#xFF0C;Xmax&#xFF0C;Ymin&#xFF0C;Ymax&#xFF08;&#x6574;&#x6570;&#x4E4B;&#x95F4;&#x7528;&#x7A7A;&#x683C;&#x5206;&#x5F00;&#xFF09;&#xFF0C;&#x4E3A;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x5750;&#x6807;&#xFF08;&#x8BE5;&#x533A;&#x57DF;&#x4E3A;&#x5E7B;&#x706F;&#x7247;&#xFF09;&#xFF0C;&#x8FD9;n&#x5F20;&#x5E7B;&#x706F;&#x7247;&#x6309;&#x5176;&#x5728;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x987A;&#x5E8F;&#x4ECE;&#x524D;&#x5230;&#x540E;&#x4F9D;&#x6B21;&#x7F16;&#x53F7;&#x4E3A;A&#xFF0C;B&#xFF0C;C&#xFF0C;&#x2026;&#x518D;&#x63A5;&#x4E0B;&#x6765;&#x7684;n&#x884C;&#x4F9D;&#x6B21;&#x4E3A;n&#x4E2A;&#x6570;&#x5B57;&#x7F16;&#x53F7;&#x7684;&#x5750;&#x6807;X&#xFF0C;Y&#xFF0C;&#x663E;&#x7136;&#x5728;&#x5E7B;&#x706F;&#x7247;&#x4E4B;&#x5916;&#x662F;&#x4E0D;&#x4F1A;&#x6709;&#x6570;&#x5B57;&#x7684;&#x3002; <strong>&#x8F93;&#x51FA;</strong> &#x82E5;&#x662F;&#x5BF9;&#x5E94;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x4F60;&#x7684;&#x8F93;&#x51FA;&#x5E94;&#x8BE5;&#x5305;&#x62EC;n&#x884C;&#xFF0C;&#x6BCF;&#x4E00;&#x884C;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x548C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4E2D;&#x95F4;&#x4EE5;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#xFF0C;&#x5E76;&#x4E14;&#x5404;&#x884C;&#x4EE5;&#x5B57;&#x6BCD;&#x7684;&#x5347;&#x5E8F;&#x6392;&#x5217;&#xFF0C;&#x6CE8;&#x610F;&#x8F93;&#x51FA;&#x7684;&#x5B57;&#x6BCD;&#x8981;&#x5927;&#x5199;&#x5E76;&#x4E14;&#x9876;&#x683C;&#xFF1B;&#x53CD;&#x4E4B;&#xFF0C;&#x82E5;&#x662F;&#x5BF9;&#x5E94;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x884C;&#x9876;&#x683C;&#x8F93;&#x51FA;None&#x5373;&#x53EF;&#x3002;&#x884C;&#x9996;&#x884C;&#x672B;&#x65E0;&#x591A;&#x4F59;&#x7A7A;&#x683C;&#x3002; <strong>&#x6837;&#x4F8B;&#x8F93;&#x5165;</strong> 4 6 22 10 20 4 18 6 16 8 20 2 18 10 24 4 8 9 15 19 17 11 7 21 11 <strong>&#x6837;&#x4F8B;&#x8F93;&#x51FA;</strong> A 4 B 1 C 2 D 3 <strong>&#x8FD9;&#x9053;&#x9898;&#x5E76;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x9898;&#xFF0C;&#x4F46;&#x5374;&#x7528;&#x5230;&#x4E86;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x7684;&#x601D;&#x60F3;</strong> <strong>&#x8BFB;&#x61C2;&#x9898;&#x610F;&#x662F;&#x5173;&#x952E;&#xFF0C;&#x672C;&#x9898;&#x610F;&#x601D;&#x662F;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x90FD;&#x5BF9;&#x5E94;&#x4E86;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x8981;&#x6C42;&#x4ECE;&#x4E2D;&#x627E;&#x51FA;&#x6570;&#x5B57;&#x4E0E;&#x5E7B;&#x706F;&#x7247;&#x7684;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;</strong> <strong>&#x8282;&#x70B9;&#x4E2A;&#x6570;&#x5F88;&#x5C11;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x90BB;&#x63A5;&#x77E9;&#x9635;&#x5B58;&#x50A8;</strong> <strong>&#x7531;&#x4E8E;&#x662F;&#x6570;&#x5B57;&#x5BF9;&#x5E94;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x9009;&#x62E9;&#x5B58;&#x50A8;&#x6BCF;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x51FA;&#x5EA6;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x6570;&#x5B57;&#x51FA;&#x5EA6;&#x4E3A;1&#x65F6;&#xFF0C;&#x5BFB;&#x627E;&#x5B83;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5E7B;&#x706F;&#x7247;&#xFF0C;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x4E0E;&#x8BE5;&#x5E7B;&#x706F;&#x7247;&#x8FDE;&#x63A5;&#x7684;&#x5176;&#x4F59;&#x6570;&#x5B57;&#x5168;&#x90E8;&#x65AD;&#x7EDD;&#x8054;&#x7CFB;&#xFF0C;&#x51FA;&#x5EA6;&#x4E5F;&#x51CF;1</strong> <strong>&#x8FD9;&#x6837;&#xFF0C;n&#x6B21;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5B8C;&#x6574;&#x7684;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;</strong> </p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAX=1000;
int X1[MAX],X2[MAX],Y1[MAX],Y2[MAX],map[MAX][MAX],cd[MAX],ans[MAX];
int stack[MAX],top;

bool IsInside(int x,int y,int t){//&#x7B2C;t&#x5F20;&#x8F93;&#x5165;&#x7684;&#x5E7B;&#x706F;&#x7247;
    return x&gt;X1[t]&amp;&amp;x&lt;X2[t]&amp;&amp;y&gt;Y1[t]&amp;&amp;y&lt;Y2[t];
} 
int main()
{
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,x,y,k=0;
    scanf(&quot;%d&quot;,&amp;n);
    for(int i=1;i&lt;=n;i++)
        scanf(&quot;%d%d%d%d&quot;,&amp;X1[i],&amp;X2[i],&amp;Y1[i],&amp;Y2[i]);
    for(int i=1;i&lt;=n;i++){
        scanf(&quot;%d%d&quot;,&amp;x,&amp;y);
        for(int j=1;j&lt;=n;j++)
            if(IsInside(x,y,j))
                map[i][j]=1,cd[i]++;//&#x7B2C;i&#x4E2A;&#x6570;&#x5B57;&#x5728;j-&apos;A&apos;+1&#x7684;&#x5E7B;&#x706F;&#x7247;&#x4E2D; 
    }

    for(int i=1;i&lt;=n;i++)
        if(cd[i]==1)
            stack[++top]=i;
    do{
        int u=stack[top--];
        k++;
        for(int v=1;v&lt;=n;v++)    
            if(map[u][v]==1){//&#x5982;&#x679C;u&#x5230;v&#x6709;&#x8DEF;&#x5F84; &#x5219;u&#x5C5E;&#x4E8E;v 
                ans[v]=u;
                for(int i=1;i&lt;=n;i++)
                if(map[i][v]==1){
                    map[i][v]=0; cd[i]--;
                    if(cd[i]==1)
                        stack[++top]=i;
                }
                break;
            }

    }while(top!=0);
    if(k!=n) printf(&quot;None&quot;);
    else
        for(int i=1;i&lt;=n;i++)
            printf(&quot;%c %d\n&quot;,&apos;A&apos;+i-1,ans[i]);

    return 0;
}
</code></pre><p>  <strong>&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF1A;</strong> <strong>&#x5EFA;&#x7ACB;&#x5728;&#x4E00;&#x79CD;&#x65B0;&#x56FE;&#x4E0A;&#xFF1A;AOV&#x56FE;&#xFF08;&#x7528;&#x70B9;&#x8868;&#x793A;&#x65F6;&#x95F4;&#xFF0C;&#x8FB9;&#x8868;&#x793A;&#x6D3B;&#x52A8;&#xFF0C;&#x8FB9;&#x7684;&#x6743;&#x503C;&#x8868;&#x793A;&#x6D3B;&#x52A8;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x56FE;&#xFF09;</strong> <strong>&#x56DB;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x91CF;</strong></p>
<ol class="ui list">
<li><strong>&#x4E8B;&#x4EF6;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;ve[]</strong></li>
<li><strong>&#x4E8B;&#x4EF6;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4;vl[]</strong></li>
<li><strong>&#x6D3B;&#x52A8;&#x6700;&#x65E9;&#x5F00;&#x59CB;&#x65F6;&#x95F4;e[]</strong></li>
<li><strong>&#x6D3B;&#x52A8;&#x6700;&#x665A;&#x5F00;&#x59CB;&#x65F6;&#x95F4;l[]</strong></li>
</ol>
<p><strong>&#x5404;&#x4E2A;&#x91CF;&#x7684;&#x6C42;&#x6CD5;&#x53CA;&#x6C42;&#x89E3;&#x987A;&#x5E8F;&#xFF1A;</strong></p>
<ol class="ui list">
<li><strong>Ve&#xFF0C;&#x4EE5;Ve[1]=0&#x5F00;&#x59CB;&#xFF0C;&#x6240;&#x6709;&#x8D77;&#x70B9;u&#x7EC8;&#x70B9;v&#x90FD;&#x6309;&#x7167;ve[v]=max(ve[v],ve[u]+dis[u][v])&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x5E76;&#x4E14;&#x8BB0;&#x5F55;&#x4E0B;&#x62D3;&#x6251;&#x5E8F;&#x5217;</strong></li>
<li><strong>Vl&#xFF0C;&#x987A;&#x5E8F;&#xFF1A;&#x9006;&#x62D3;&#x6251;&#x5E8F;&#x5217;&#xFF0C;&#x4EE5;Vl[n]=Ve[n]&#x5F00;&#x59CB;&#xFF0C;&#xFF08;&#x56E0;&#x4E3A;&#x7EC8;&#x70B9;&#x662F;&#x5173;&#x952E;&#x4E8B;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x65E9;&#x548C;&#x6700;&#x665A;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x76F8;&#x7B49;&#xFF09;&#x8D77;&#x70B9;u&#x7EC8;&#x70B9;v&#x90FD;&#x6309;&#x7167;vl[v]=min(vl[v],vl[u]-dis[u][v])&#x7684;&#x65B9;&#x6CD5;&#x6C42;&#x89E3;&#xFF08;&#x6B64;&#x5904;&#x6CE8;&#x610F;&#xFF0C;&#x7A0B;&#x5E8F;&#x5F00;&#x5934;&#x5FC5;&#x987B;memset&#xFF09;</strong></li>
<li><strong>e&#xFF0C;&#x4E8B;&#x4EF6;&#x7684;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x5C31;&#x7B49;&#x4E8E;&#x6D3B;&#x52A8;&#x7684;&#x6700;&#x65E9;&#x5F00;&#x59CB;&#x65F6;&#x95F4;</strong></li>
<li><strong>l&#xFF0C;&#x5BF9;&#x4E8E;&#x8D77;&#x70B9;x&#x7EC8;&#x70B9;y&#x4E4B;&#x95F4;&#x7684;&#x6D3B;&#x52A8;i&#xFF0C;l[i]=vl[y]-dis[x][y]</strong></li>
</ol>
<p><strong>&#x5982;&#x679C;e[i]==l[i]&#x5219;&#x8BF4;&#x5B83;&#x662F;&#x5173;&#x952E;&#x6D3B;&#x52A8;</strong> <strong>&#x7ED3;&#x675F;&#x3002;</strong>  <strong>Question&#xFF1A;&#x6D3B;&#x52A8;&#x7684;&#x6700;&#x65E9;&#x6700;&#x665A;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x548C;&#x4E8B;&#x4EF6;&#x7684;&#x6700;&#x65E9;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x5C5E;&#x4E8E;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x4E2D;&#x7684;&#x90A3;&#x4E00;&#x4E2A;&#x91CF;&#xFF1F;&#xFF08;&#x6211;&#x53EA;&#x4F1A;&#x6C42;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x660E;&#x767D;&#x5B83;&#x4EEC;&#x7684;&#x5DEE;&#x522B;&#x6216;&#x8005;&#x7528;&#x9014;&#xFF09;</strong> <strong>&#x524D;&#x9762;&#x5956;&#x91D1;&#x4E00;&#x9898;&#x6240;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x662F;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x6C42;&#x4E8B;&#x4EF6;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#xFF1F;</strong> </p>
<h2 id="&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BA1;&#x7B97;"><a href="#&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BA1;&#x7B97;" class="headerlink" title="&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BA1;&#x7B97;"></a>&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BA1;&#x7B97;</h2><p>&#xFF08;<a href="http://fz.openjudge.cn/graph/015/&#xFF09;" target="_blank" rel="noopener">http://fz.openjudge.cn/graph/015/&#xFF09;</a> <strong>&#x63CF;&#x8FF0;</strong> &#x7ED9;&#x51FA;&#x4E00;&#x4E2A;AOE&#x56FE;&#xFF0C;&#x8BF7;&#x8F93;&#x51FA;&#x5176;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF1B; <strong>&#x8F93;&#x5165;</strong> &#x7B2C;&#x4E00;&#x884C;&#xFF1A;n&#xFF0C;m&#xFF08;n,m&lt;=100&#x5206;&#x522B;&#x8868;&#x793A;&#x8282;&#x70B9;&#x4E2A;&#x6570;&#x4E0E;&#x8FB9;&#x7684;&#x6761;&#x6570;&#xFF09; &#x63A5;&#x4E0B;&#x6765;m&#x884C;&#xFF0C;&#x7B2C;i+1&#x884C;&#xFF0C;&#x8868;&#x793A;&#x7B2C;i&#x6761;&#x8FB9;&#xFF0C;&#x6BCF;&#x884C;&#x4E09;&#x4E2A;&#x6570;&#xFF1A;ai,bi,ci&#xFF0C;&#x8868;&#x793A;&#x5B58;&#x5728;&#x4E00;&#x6761;ai&#x6307;&#x5411;bi&#x6743;&#x503C;&#x4E3A;ci&#x7684;&#x8FB9;&#x3002; &#x6CE8;&#x610F;&#xFF1A;&#x8D77;&#x70B9;&#x4E3A;&#x7ED3;&#x70B9;1&#xFF0C;&#x7EC8;&#x70B9;&#x4E3A;&#x7ED3;&#x70B9;n <strong>&#x8F93;&#x51FA;</strong> &#x5C06;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x8FB9;&#x7684;&#x7F16;&#x53F7;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x8F93;&#x51FA; <strong>&#x6837;&#x4F8B;&#x8F93;&#x5165;</strong> 9 11 1 2 6 1 3 4 1 4 5 2 5 1 3 5 1 4 6 2 5 7 9 5 8 7 6 8 4 7 9 2 8 9 4 <strong>&#x6837;&#x4F8B;&#x8F93;&#x51FA;</strong> 1 4 7 8 10 11 <strong>&#x6807;&#x51C6;&#x95EE;&#x9898;&#xFF0C;&#x6CE8;&#x610F;&#x5728;&#x8F93;&#x51FA;&#x4E4B;&#x524D;&#x8981;&#x6392;&#x5E8F;</strong></p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAX=1000;
int first[MAX],go[MAX],nxt[MAX],dis[MAX][MAX],arcnum=1;
int stack[MAX],top,ve[MAX],vl[MAX],e[MAX],l[MAX],rd[MAX];
int order[MAX],ans[MAX],sum;
void addarc(int a,int b,int c){
    nxt[arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum++]=b;
    dis[a][b]=c;
}
int main(){
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,m,a,b,c,k=0;
    scanf(&quot;%d%d&quot;,&amp;n,&amp;m);
    memset(vl,127,sizeof(vl));
    for(int i=1;i&lt;=m;i++){
        scanf(&quot;%d%d%d&quot;,&amp;a,&amp;b,&amp;c);
        addarc(a,b,c);
        rd[b]++;
    }
    for(int i=1;i&lt;=n;i++)
        if(rd[i]==0)
            stack[++top]=i;//&#x5165;&#x6808; 
    do{//&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x6C42;&#x4E8B;&#x4EF6;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4; 
        int u=stack[top--],v; k++;
        order[k]=u;//&#x8BB0;&#x5F55;&#x987A;&#x5E8F; 
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p]; rd[v]--;
            ve[v]=max(ve[v],ve[u]+dis[u][v]);
            if(rd[v]==0)
                stack[++top]=v;
        }
    }while(top!=0);

    vl[n]=ve[n];//&#x4E2D;&#x70B9;&#x7684;&#x4E8B;&#x4EF6;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x7B49;&#x4E8E;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4; 
    for(int i=n-1;i&gt;=1;i--){
        int u=order[i],v;
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p];
            vl[u]=min(vl[u],vl[v]-dis[u][v]);
        }
    }

    for(int i=1;i&lt;=n-1;i++){//&#x8BA1;&#x7B97;&#x6D3B;&#x52A8;&#x7684;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x548C;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4; 
        int u=order[i],v;
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p];
            e[p]=ve[u];//&#x6D3B;&#x52A8;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x7B49;&#x4E8E;&#x8D77;&#x59CB;&#x70B9;&#x7684;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4; 
            l[p]=vl[v]-dis[u][v];//&#x6D3B;&#x52A8;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x7B49;&#x4E8E;&#x7EC8;&#x70B9;&#x6700;&#x665A;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x51CF;&#x53BB;&#x6D3B;&#x52A8;&#x7684;&#x957F;&#x5EA6; 
            if(e[p]==l[p]) ans[++sum]=p;
        }
    }

    sort(ans+1,ans+1+sum);
    for(int i=1;i&lt;=sum;i++)
        printf(&quot;%d\n&quot;,ans[i]);
    return 0;
}
</code></pre><h1 id="HDU4109-Instrction-Arrangement"><a href="#HDU4109-Instrction-Arrangement" class="headerlink" title="HDU4109 Instrction Arrangement"></a>HDU4109 Instrction Arrangement</h1><p><a href="http://acm.hdu.edu.cn/showproblem.php?pid=4109" target="_blank" rel="noopener">http://acm.hdu.edu.cn/showproblem.php?pid=4109</a> <strong>Problem Description</strong> &#x963F;&#x72F8;&#x8FD9;&#x4E2A;&#x5B66;&#x671F;&#x5B66;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x8BFE;&#x7A0B;&#x3002;&#x4ED6;&#x77E5;&#x9053;&#x4E86;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x6709;&#x4F9D;&#x5B58;&#x5173;&#x7CFB;&#xFF0C;&#x50CF;WAR&#xFF08;write after read&#xFF0C;&#x8BFB;&#x4E4B;&#x540E;&#x5199;&#xFF09;&#xFF0C;WAW&#xFF0C;RAW&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;&#x5B89;&#x5168;&#x65F6;&#x95F4;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x5371;&#x9669;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x8D77;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BBE;&#x8BA1;&#x7279;&#x6B8A;&#x7684;&#x56DE;&#x8DEF;&#x53BB;&#x6D88;&#x9664;&#x5371;&#x9669;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6DFB;&#x52A0;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF08;&#x6216;&#x8005;&#x7531;&#x5176;&#x5B83;&#x7684;&#x64CD;&#x4F5C;&#x586B;&#x5145;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x7684;&#x64CD;&#x4F5C;&#x586B;&#x5145;&#x5C31;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x53BB;&#x4FDD;&#x8BC1;&#x4E24;&#x4E2A;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x5C0F;&#x4E8E;&#x5B89;&#x5168;&#x65F6;&#x95F4;&#x3002; &#x4E24;&#x4E2A;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x7684;&#x5B9A;&#x4E49;&#x5C31;&#x662F;&#x5B83;&#x4EEC;&#x8D77;&#x59CB;&#x65F6;&#x95F4;&#x5DEE;&#x3002; &#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x6307;&#x4EE4;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4F9D;&#x5B58;&#x5173;&#x7CFB;&#x548C;&#x6307;&#x4EE4;&#x4E4B;&#x95F4;&#x7684;&#x5B89;&#x5168;&#x4E8B;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x6709;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x65E0;&#x9650;&#x6838;&#x7684;CPU&#x3002;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x60F3;&#x8DD1;&#x591A;&#x5C11;&#x6307;&#x4EE4;&#x5C31;&#x8DD1;&#x591A;&#x5C11;&#x6307;&#x4EE4;&#x3002;&#x8FD9;&#x4E2A;CPU&#x53EF;&#x4EE5;&#x53EA;&#x6D88;&#x8017;1ns&#x5C31;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x6307;&#x4EE4;&#x3002; &#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x91CD;&#x65B0;&#x5B89;&#x6392;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x987A;&#x5E8F;&#x6240;&#x4EE5;CPU&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x6700;&#x77ED;&#x65F6;&#x95F4;&#x5B8C;&#x6210;&#x6240;&#x6709;&#x7684;&#x6307;&#x4EE4;&#x3002; <strong>Input</strong> &#x8F93;&#x5165;&#x5305;&#x62EC;&#x51E0;&#x4E2A;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B; &#x5934;&#x4E24;&#x884C;&#x6709;&#x4E24;&#x4E2A;&#x6574;&#x6570;N,M&#xFF08;N&lt;=1000,M&lt;=1000&#xFF09;&#xFF0C;&#x5176;&#x4E2D;N&#x8868;&#x793A;N&#x6761;&#x6307;&#x4EE4;&#x548C;M&#x8868;&#x793A;M&#x4E2A;&#x4F9D;&#x5B58;&#x5173;&#x7CFB; &#x63A5;&#x4E0B;&#x6765;&#x7684;M&#x884C;&#xFF0C;&#x6BCF;&#x884C;&#x5305;&#x62EC;3&#x4E2A;&#x6574;&#x6570;X,Y,Z&#xFF0C;&#x610F;&#x601D;&#x662F;X&#x548C;Y&#x4E4B;&#x95F4;&#x7684;&#x5B89;&#x5168;&#x65F6;&#x95F4;&#x662F;Z&#xFF0C;&#x800C;&#x4E14;Y&#x5FC5;&#x987B;&#x5728;X&#x4E4B;&#x540E;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x4ECE;0&#x5230;N-1&#x6807;&#x53F7;&#x3002; <strong>Output</strong> &#x6253;&#x5370;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;CPU&#x8FD0;&#x884C;&#x7684;&#x6700;&#x77ED;&#x65F6;&#x95F4; <strong>Sample Input</strong> 5 2 1 2 1 3 4 1 <strong>Sample Output</strong> 2 <strong>HINT</strong> &#x5728;&#x7B2C;1ns&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;0&#xFF0C;1&#x548C;3&#x88AB;&#x6267;&#x884C;&#x4E86;&#x3002; &#x5728;&#x7B2C;2ns&#x4E2D;&#xFF0C;&#x6307;&#x4EE4;2,&#x548C;4&#x88AB;&#x6267;&#x884C;&#x4E86; &#x6240;&#x4EE5;&#x7B54;&#x6848;&#x662F;2 <strong>&#x4E5F;&#x662F;&#x6C42;&#x4E8B;&#x4EF6;&#x6700;&#x65E9;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#xFF08;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6700;&#x65E9;&#x5168;&#x90E8;&#x6267;&#x884C;&#x5B8C;&#xFF09;&#x7684;&#x9898;</strong> <strong>&#x6CE8;&#x610F;&#xFF1A;</strong></p>
<ol class="ui list">
<li><strong>memset&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#xFF01;</strong></li>
<li><p><strong>&#x6307;&#x4EE4;&#x7531;0&#x5230;n-1&#x7F16;&#x53F7;&#xFF0C;&#x6CE8;&#x610F;&#x8F6C;&#x6362;</strong></p>
<p>#include<cstdio><br>#include<cstring><br>#include<algorithm><br>using namespace std;<br>const int MAX=1020;<br>int first[MAX],nxt[10200],go[10200],arcnum;<br>int dis[MAX][MAX],rd[MAX],val[MAX],stack[10200],top;<br>void addarc(int a,int b,int c){</algorithm></cstring></cstdio></p>
<pre><code>nxt[arcnum]=first[a];
first[a]=arcnum;
go[arcnum++]=b;
dis[a][b]=c;
</code></pre><p>}</p>
<p>int main()<br>{<br>//    freopen(&#x201C;in.txt&#x201D;,&#x201D;r&#x201D;,stdin);</p>
<pre><code>int n,m,x,y,z,maxx;
while(scanf(&quot;%d%d&quot;,&amp;n,&amp;m)!=EOF){
    memset(dis,0,sizeof(dis));
    memset(rd,0,sizeof(rd));
    memset(val,0,sizeof(val));
    memset(first,0,sizeof(first));
    maxx=-1; arcnum=1;
    for(int i=1;i&lt;=n;i++)
        val[i]=1;
    for(int i=1;i&lt;=m;i++){
        scanf(&quot;%d%d%d&quot;,&amp;x,&amp;y,&amp;z);
        addarc(++x,++y,z);
        rd[y]++;
    }
    for(int i=1;i&lt;=n;i++)    
        if(rd[i]==0)
            stack[++top]=i;
    do{
        int u=stack[top--],v;
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p];
            val[v]=max(val[v],val[u]+dis[u][v]);
            maxx=max(val[v],maxx);
            if(--rd[v]==0)
                stack[++top]=v;
        }

    }while(top!=0);
    printf(&quot;%d\n&quot;,maxx);
}
return 0;
</code></pre><p>}</p>
<p><strong>Poj3687 Labeling Balls</strong> <strong>escription</strong> Windy&#x6709;N&#x4E2A;&#x4E0D;&#x540C;&#x91CD;&#x91CF;&#x7684;&#x6C42;&#xFF0C;&#x73B0;&#x5728;&#x4ED6;&#x6253;&#x7B97;&#x7ED9;&#x4ED6;&#x4EEC;&#x8D34;&#x4E0A;1&#x5230;N&#x7684;&#x6807;&#x7B7E;&#xFF1A; &#x6CA1;&#x6709;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x7403; &#x8FD9;&#x4E9B;&#x6807;&#x7B7E;&#x8981;&#x7B26;&#x5408;&#x89C4;&#x5219;&#x4F8B;&#x5982;&#x201C;&#x6807;&#x7B7E;a&#x7403;&#x8F7B;&#x4E8E;&#x6807;&#x7B7E;b&#x7403;&#x201D; &#x4F60;&#x80FD;&#x5E2E;&#x4ED6;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5417;&#xFF1F; <strong>Input</strong> &#x7B2C;&#x4E00;&#x884C;&#x662F;&#x6570;&#x636E;&#x4E2A;&#x6570;.&#x6BCF;&#x7EC4;&#x6570;&#x636E;&#x7B2C;&#x4E00;&#x884C;&#x662F;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#xFF1A; N (1 &#x2264; N &#x2264; 200)&#x548C; M (0 &#x2264; M &#x2264; 40,000).&#x63A5;&#x4E0B;&#x6765;M&#x884C;&#xFF0C;&#x6BCF;&#x884C;&#x4E24;&#x4E2A;&#x6574;&#x6570;a&#x548C; b&#x8868;&#x793A; &#x6807;&#x7B7E;a&#x7403;&#x8F7B;&#x4E8E;&#x6807;&#x7B7E;b&#x7403;. (1 &#x2264; a, b &#x2264; N) &#x6BCF;&#x7EC4;&#x6570;&#x636E;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x884C; <strong>Output</strong> &#x6BCF;&#x7EC4;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x8F93;&#x51FA;&#x4E00;&#x884C;&#xFF0C;&#x6309;&#x7167;&#x5C0F;&#x7403;&#x7684;1~N&#xFF0C;&#x5C0F;&#x7403;&#x7684;&#x91CD;&#x91CF;&#x8F93;&#x51FA;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x7EC4;&#x89E3;&#xFF1A; you should output the one with the smallest weight for label 1, then with the smallest weight for label 2, then with the smallest weight for label 3 and so on&#x2026;&#x5982;&#x679C;&#x65E0;&#x89E3;&#xFF0C;&#x8F93;&#x51FA;-1&#x3002; <strong>Sample Input</strong> 5 4 0 4 1 1 1 4 2 1 2 2 1 4 1 2 1 4 1 3 2 <strong>Sample Output</strong> 1 2 3 4 -1 -1 2 1 3 4 1 3 2 4 <strong>&#x8FD9;&#x9053;&#x9898;&#x81F3;&#x4ECA;&#x672A;&#x901A;&#x8FC7;&#x3002;&#x521D;&#x6B65;&#x601D;&#x8DEF;&#x662F;&#x5EFA;&#x7ACB;&#x5C0F;&#x9876;&#x5806;&#x548C;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x51E0;&#x4E2A;&#x7403;&#x91CD;&#x91CF;&#x76F8;&#x7B49;&#x65F6;&#x8F93;&#x51FA;&#x7F16;&#x53F7;&#x6700;&#x5C0F;&#x7684;&#x3002;</strong> <strong>&#x4F46;&#x662F;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x6211;&#x64CD;&#x4F5C;&#x5165;&#x5EA6;&#x4E3A;0&#x7684;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53C8;&#x6709;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x52A0;&#x5165;&#x5806;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x6211;&#x6574;&#x4E2A;&#x7B54;&#x6848;&#x5B8C;&#x5168;&#x4E0D;&#x5BF9;&#x3002;</strong></p>
<p>#include<cstdio><br>#include<cstring><br>#include<algorithm><br>using namespace std;<br>int first[300],nxt[40200],go[40200],arcnum;<br>int rd[300],stack[40200],ans[300],heap[10000],len;<br>void addarc(int a,int b){</algorithm></cstring></cstdio></p>
<pre><code>nxt[arcnum]=first[a];
first[a]=arcnum;
go[arcnum++]=b;
</code></pre><p>}</p>
<p>bool cmp(int a,int b){</p>
<pre><code>return a&lt;b;
</code></pre><p>}</p>
<p>int Get(){</p>
<pre><code>int t=heap[1],now=1,next;
heap[1]=heap[len--];
while(now*2&lt;=len){
    next=now*2;
    if(next&lt;len&amp;&amp;cmp(heap[next+1],heap[next])) next++;
    if(cmp(heap[now],heap[next])) break;
    swap(heap[now],heap[next]);
    now=next;
}
return t;
</code></pre><p>}</p>
<p>void Put(int p){</p>
<pre><code>int now=++len,next;
heap[len]=p;
while(now&gt;1){
    next=now&gt;&gt;1;
    if(!cmp(heap[now],heap[next])) break;
    swap(heap[now],heap[next]);    
    now=next;
}
</code></pre><p>}</p>
<p>int main()<br>{</p>
<pre><code>int t,n,m,a,b,k;
scanf(&quot;%d&quot;,&amp;t);
while(t--){
    arcnum=1; k=0; len=0;
    memset(first,0,sizeof(first));
    memset(rd,0,sizeof(rd));
    memset(ans,0,sizeof(ans));
    scanf(&quot;%d%d&quot;,&amp;n,&amp;m);
    for(int i=1;i&lt;=m;i++){
        scanf(&quot;%d%d&quot;,&amp;a,&amp;b);
        addarc(a,b);
        rd[b]++;
    }
    for(int i=1;i&lt;=n;i++)
        if(rd[i]==0)
            Put(i);
    do{
        int u=Get(),v;
        ans[u]=++k;
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p];
            if(--rd[v]==0)
                Put(v);
        }
    }while(len&gt;0);
    if(k!=n) printf(&quot;-1\n&quot;);
    else{
        for(int i=1;i&lt;=n;i++)
            printf(&quot;%d &quot;,ans[i]);
        printf(&quot;\n&quot;);
    }
}

return 0;
</code></pre><p>}</p>
</li>
</ol>
<p><strong>&#x53C8;&#x60F3;&#x5230;&#x628A;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x70B9;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x6765;&#x4E2A;&#x5FEB;&#x6392;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x7684;&#x7403;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x6761;&#x4EF6;&#xFF0C;&#x5F3A;&#x884C;&#x628A;&#x6743;&#x8BBE;&#x4E3A;0&#x53C8;&#x4F1A;&#x9519;&#x3002;</strong></p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
int first[300],nxt[40200],go[40200],arcnum;
int rd[300],stack[40200],top;
struct node{
    int val,id;
}ans[300];

void addarc(int a,int b){
    nxt[arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum++]=b;
}

bool cmp(node a,node b){
    if(a.val!=b.val)
        return a.val&lt;b.val;
    return a.id&lt;b.id;
}

int main()
{
    int t,n,m,a,b,k;
    scanf(&quot;%d&quot;,&amp;t);
    while(t--){
        arcnum=1; k=0; top=0;
        memset(first,0,sizeof(first));
        memset(rd,0,sizeof(rd));
        memset(ans,0,sizeof(ans));
        scanf(&quot;%d%d&quot;,&amp;n,&amp;m);
        for(int i=1;i&lt;=n;i++)
            ans[i].id=i,ans[i].val=0;
        for(int i=1;i&lt;=m;i++){
            scanf(&quot;%d%d&quot;,&amp;a,&amp;b);
            addarc(a,b);
            rd[b]++;
        }
        for(int i=1;i&lt;=n;i++)
            if(rd[i]==0)
                stack[++top]=i;
        do{
            int u=stack[top--],v;
            k++;
            for(int p=first[u];p!=0;p=nxt[p]){
                v=go[p];
                ans[v].val=max(ans[v].val,ans[u].val+1);
                if(--rd[v]==0)
                    stack[++top]=v;
            }
        }while(top!=0);
        if(k!=n) printf(&quot;-1\n&quot;);
        else{
            sort(ans+1,ans+1+n,cmp);
            for(int i=1;i&lt;=n;i++)
                printf(&quot;%d &quot;,ans[i].id);
            printf(&quot;\n&quot;);
        }
    }

    return 0;
}
</code></pre><p><strong>&#x636E;&#x8BF4;&#x5EFA;&#x7ACB;&#x5927;&#x9876;&#x5806;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF1F;&#xFF1F;&#xFF1F;&#xFF1F;</strong></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-12-06T15:42:05.000Z" itemprop="datePublished">2018-12-06</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2018/12/06/tarjan-e7-ae-97-e6-b3-95-e6-b1-82-e5-bc-ba-e8-bf-9e-e9-80-9a-e5-88-86-e9-87-8f-e6-80-bb-e7-bb-93/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    Tarjan算法求强连通分量总结
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2018/12/06/e6-9c-80-e5-b0-8f-e7-94-9f-e6-88-90-e6-a0-91-e6-80-bb-e7-bb-93/" class="ui tiny button">
                    
                    最小生成树总结
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#关键路径计算"><span>关键路径计算</span></a></li></ol><li><a href="#HDU4109-Instrction-Arrangement"><span>HDU4109 Instrction Arrangement</span></a>
                </li></div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">mrh929</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
