

<!DOCTYPE html>
<html lang="cn">
<head prefix="og: http://ogp.me/ns#"><meta name="generator" content="Hexo 3.8.0">
    <meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1">
    <meta name="description" content="Blog">
    <title>树形动态规划总结 | mrh929&#39;s home</title>

    <!-- Open Graph -->
    <meta name="description" content="&amp;#x6811;&amp;#x5F62;&amp;#x52A8;&amp;#x89C4;&amp;#x603B;&amp;#x7ED3;&amp;#x6811;&amp;#x578B;&amp;#x52A8;&amp;#x89C4;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x65B9;&amp;#x5F0F;&amp;#x540C;&amp;#x666E;&amp;#x901A;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x52A8;&amp;#x6001;&amp;#x89C4;&amp;#x5212;">
<meta property="og:type" content="article">
<meta property="og:title" content="树形动态规划总结">
<meta property="og:url" content="http://mrh1s.top/2018/12/06/e6-a0-91-e5-bd-a2-e5-8a-a8-e6-80-81-e8-a7-84-e5-88-92-e6-80-bb-e7-bb-93/index.html">
<meta property="og:site_name" content="mrh929&#39;s home">
<meta property="og:description" content="&amp;#x6811;&amp;#x5F62;&amp;#x52A8;&amp;#x89C4;&amp;#x603B;&amp;#x7ED3;&amp;#x6811;&amp;#x578B;&amp;#x52A8;&amp;#x89C4;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x65B9;&amp;#x5F0F;&amp;#x540C;&amp;#x666E;&amp;#x901A;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x52A8;&amp;#x6001;&amp;#x89C4;&amp;#x5212;">
<meta property="og:locale" content="cn">
<meta property="og:image" content="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==">
<meta property="og:image" content="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==">
<meta property="og:image" content="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==">
<meta property="og:updated_time" content="2019-05-03T06:19:59.674Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="树形动态规划总结">
<meta name="twitter:description" content="&amp;#x6811;&amp;#x5F62;&amp;#x52A8;&amp;#x89C4;&amp;#x603B;&amp;#x7ED3;&amp;#x6811;&amp;#x578B;&amp;#x52A8;&amp;#x89C4;&amp;#x7684;&amp;#x57FA;&amp;#x672C;&amp;#x65B9;&amp;#x5F0F;&amp;#x540C;&amp;#x666E;&amp;#x901A;&amp;#x7684;&amp;#x7EBF;&amp;#x6027;&amp;#x52A8;&amp;#x6001;&amp;#x89C4;&amp;#x5212;">
<meta name="twitter:image" content="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==">

    <script type="application/ld+json">
{
  "@context": "http://schema.org",
  "@type": "Person",
  "email": "mailto:",
  "image": "",
  "name": "mrh929",
  "url": "http://mrh1s.top"
}
</script>
    <script>
    var algoliaEnabled = false;
    
</script>

    

    
    
        <link href="https://fonts.googleapis.com/css?family=Source+Code+Pro" rel="stylesheet" type="text/css">
    
    
    
        <!-- stylesheets list from config.yml -->
        
        <link rel="stylesheet" href="/css/aloha.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.css">
        
        <link rel="stylesheet" href="//cdn.bootcss.com/magnific-popup.js/1.1.0/magnific-popup.min.css">
        
    

</head>
<body id="body" style="margin-bottom: 0;" class="pushable">

    <div class="ui top fixed menu">
        <a class="item" id="menu-icon"><i class="sidebar icon"></i></a>
    </div>

    <div id="menu-sidebar" class="ui left vertical sidebar menu">

    <div id="sidebar-top">
        <div class="content">
            <h3>mrh929&#39;s home</h3>
        </div>
    </div>
    <div class="ui container sidebar-card">
    <div class="ui people shape content">
        <div class="active side">
            <div class="ui card">
                <div class="image">
                    <img class="ui medium bordered image" src="/images/avatar.jpg">
                </div>
                <div class="content">
                    <a class="header">mrh929</a>
                    
                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                        
                    </div>

                </div>
                <div class="extra content">
                    <div class="ui list">
                        
                    </div>
                </div>
            </div>
        </div>
    </div>


</div>

    
    

    

    
    <a href="/index.html" class="item">
        <i class="home icon"></i>
        HOME
    </a>

    

    
</div>

    <div class="pusher body-content">
        <div id="content" class="ui main container">
            <!--<div class="ui one column grid">-->
                <!--<div class="column">-->
                    <!--<div class="ui main container">-->
                        <div id="post-e6-a0-91-e5-bd-a2-e5-8a-a8-e6-80-81-e8-a7-84-e5-88-92-e6-80-bb-e7-bb-93" class="ui main container article-type-post">

    

    <div class="ui divided grid">

        <div class="two column row" id="article-content">

            <div class="thirteen wide computer thirteen wide tablet sixteen wide mobile column">
                

<h1 class="ui header">
    
    树形动态规划总结
</h1>



                <div class="article-inner">

                    <div class="article-entry" itemprop="articleBody">
                        
                        <h1 id="&#x6811;&#x5F62;&#x52A8;&#x89C4;&#x603B;&#x7ED3;"><a href="#&#x6811;&#x5F62;&#x52A8;&#x89C4;&#x603B;&#x7ED3;" class="headerlink" title="&#x6811;&#x5F62;&#x52A8;&#x89C4;&#x603B;&#x7ED3;"></a>&#x6811;&#x5F62;&#x52A8;&#x89C4;&#x603B;&#x7ED3;</h1><p><strong>&#x6811;&#x578B;&#x52A8;&#x89C4;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x5F0F;&#x540C;&#x666E;&#x901A;&#x7684;&#x7EBF;&#x6027;&#x52A8;&#x6001;&#x89C4;&#x5212;&#xFF0C;&#x4F46;&#x904D;&#x5386;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x7531;&#x9AD8;&#x6DF1;&#x5EA6;&#x5411;&#x4F4E;&#x6DF1;&#x5EA6;&#x76F4;&#x81F3;&#x6839;&#x8282;&#x70B9;&#xFF0C;&#x901A;&#x5E38;&#x4E00;&#x4E2A;&#x6811;&#x578B;&#x52A8;&#x89C4;&#x5305;&#x62EC;&#x4E86;&#x72B6;&#x6001;&#x3001;&#x9636;&#x6BB5;&#x3001;&#x51B3;&#x7B56;&#x3001;&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x65B9;&#x7A0B;&#xFF0C;&#x627E;&#x5230;&#x6BCF;&#x4E2A;&#x9898;&#x76EE;&#x5BF9;&#x5E94;&#x7684;&#x52A8;&#x5F52;&#x8981;&#x7D20;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x9898;&#x76EE;&#x7684;&#x96BE;&#x70B9;&#x6240;&#x5728;&#x3002;</strong></p>
<ol class="ui list">
<li><strong>&#x72B6;&#x6001;&#xFF1A;&#x7A0B;&#x5E8F;&#x6C42;&#x89E3;&#x5230;&#x6BCF;&#x4E2A;&#x7A0B;&#x5EA6;&#x6240;&#x50A8;&#x5B58;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x627E;&#x5230;&#x9002;&#x5408;&#x9898;&#x76EE;&#x7684;&#x72B6;&#x6001;&#x5E76;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#x3002;Tips&#xFF1A;&#x627E;&#x72B6;&#x6001;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x786E;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x6743;&#x8861;&#x53D8;&#x91CF;&#x7684;&#x8303;&#x56F4;&#x6765;&#x5BFB;&#x627E;&#x3002;</strong></li>
<li><strong>&#x9636;&#x6BB5;&#xFF1A;&#x5C31;&#x662F;&#x6C42;&#x89E3;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x6BCF;&#x6B21;&#x6C42;&#x89E3;&#x7684;&#x72B6;&#x6001;&#x90FD;&#x5FC5;&#x987B;&#x8FD0;&#x7528;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x6C42;&#x89E3;&#x8FC7;&#x7684;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x3002;</strong></li>
<li><strong>&#x51B3;&#x7B56;&#xFF1A;&#x9009;&#x62E9;&#x6700;&#x4F18;&#x89E3;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x6C42;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x6700;&#x5C0F;&#x503C;&#x7B49;&#x3002;</strong></li>
<li><p><strong>&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x65B9;&#x7A0B;&#xFF1A;&#x601D;&#x8003;&#x51FA;&#x51B3;&#x7B56;&#x540E;&#xFF0C;&#x7528;&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x65B9;&#x7A0B;&#x5C06;&#x5176;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#x3002;</strong></p>
<p><strong>&#x5173;&#x4E8E;&#x6C42;&#x89E3;&#x987A;&#x5E8F;&#xFF1A;&#x7531;&#x4E8E;&#x6811;&#x5F62;&#x52A8;&#x5F52;&#x7684;&#x7279;&#x6B8A;&#x6027;&#xFF08;&#x51E0;&#x4E4E;&#x90FD;&#x662F;&#x65E0;&#x5411;&#x8FB9;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x4ECE;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5F00;&#x59CB;&#x904D;&#x5386;&#xFF0C;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;</strong></p>
</li>
<li><p><strong>&#x5148;&#x7ED9;&#x6811;&#x505A;&#x4E00;&#x6B21;BFS&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4E00;&#x4E00;&#x51FA;&#x961F;&#xFF0C;&#x5C31;&#x662F;&#x6811;&#x578B;&#x52A8;&#x89C4;&#x7684;&#x987A;&#x5E8F;&#x3002;</strong></p>
</li>
<li><strong>&#x627E;&#x5EA6;&#x4E3A;2&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x65B0;&#x5B83;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x5EA6;&#x6570;&#xFF0C;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x62D3;&#x6251;&#x6392;&#x5E8F;&#x64CD;&#x4F5C;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x4E5F;&#x662F;&#x6811;&#x578B;&#x52A8;&#x89C4;&#x7684;&#x987A;&#x5E8F;&#x3002;</strong></li>
<li><p><strong>&#x7528;&#x9012;&#x5F52;&#x5C06;&#x6811;&#x7684;&#x540E;&#x5E8F;&#x904D;&#x5386;&#x6C42;&#x51FA;&#xFF0C;&#x5373;&#x53EF;&#x5C06;&#x4E00;&#x68F5;&#x6811;&#x7EBF;&#x6027;&#x5316;</strong></p>
<p><strong>&#x62D3;&#x5C55;&#xFF1A;&#x72B6;&#x6001;&#x538B;&#x7F29;</strong> <strong>      &#x5F53;&#x6211;&#x4EEC;&#x7684;&#x67D0;&#x4E2A;&#x72B6;&#x6001;&#x8FC7;&#x4E8E;&#x7E41;&#x7410;&#xFF0C;&#x5F88;&#x96BE;&#x5C06;&#x5176;&#x7528;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x8868;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;</strong> <strong>&#x5982;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x9898;&#x76EE;&#xFF0C;&#x8BBE;&#x7ACB;&#x5206;&#x90E8;&#x7684;&#x65F6;&#x5019;&#x5404;&#x4E2A;&#x5206;&#x90E8;&#x4F1A;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x90E8;&#x4E4B;&#x95F4;&#x5F71;&#x54CD;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4E0D;&#x50CF;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7684;&#x52A8;&#x5F52;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7269;&#x54C1;&#x4E00;&#x89C6;&#x540C;&#x4EC1;&#x3002;</strong> <strong>      &#x6BD4;&#x5982;&#x67D0;&#x7ED3;&#x70B9;&#x9009;&#x62E9;1&#x3001;2&#x3001;3&#x5206;&#x90E8;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x603B;&#x8D44;&#x91D1;&#x635F;&#x5931;&#xFF0C;&#x800C;&#x9009;&#x62E9;1&#x3001;4&#x5206;&#x90E8;&#xFF0C;&#x603B;&#x8D44;&#x91D1;&#x5374;&#x4F1A;&#x589E;&#x52A0;&#x2026;&#x2026;</strong> <strong>      &#x89C2;&#x5BDF;&#x5206;&#x90E8;&#x7684;&#x603B;&#x6570;&#x91CF;&#xFF0C;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;8&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x4F4D;&#x8FD0;&#x7B97;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#xFF0C;&#x5C06;1~8&#x5206;&#x90E8;&#x7684;&#x9009;&#x62E9;&#x60C5;&#x51B5;&#x7528;&#x4E00;&#x4E2A;int&#x53D8;&#x91CF;&#x50A8;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x8D77;&#x5230;&#x8868;&#x793A;&#x72B6;&#x6001;&#x7684;&#x4F5C;&#x7528;&#x3002;</strong>    <strong>Ural 1039&#x6CA1;&#x6709;&#x4E0A;&#x53F8;&#x7684;&#x665A;&#x4F1A;</strong> &#x80CC;&#x666F; &#x6709;&#x4E2A;&#x516C;&#x53F8;&#x8981;&#x4E3E;&#x884C;&#x4E00;&#x573A;&#x665A;&#x4F1A;&#x3002; &#x4E3A;&#x4E86;&#x80FD;&#x73A9;&#x5F97;&#x5F00;&#x5FC3;&#xFF0C;&#x516C;&#x53F8;&#x9886;&#x5BFC;&#x51B3;&#x5B9A;&#xFF1A;&#x5982;&#x679C;&#x9080;&#x8BF7;&#x4E86;&#x67D0;&#x4E2A;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5B9A;&#x4E0D;&#x4F1A;&#x9080;&#x8BF7;&#x4ED6;&#x7684;&#x4E0A;&#x53F8; &#xFF08;&#x4E0A;&#x53F8;&#x7684;&#x4E0A;&#x53F8;&#xFF0C;&#x4E0A;&#x53F8;&#x7684;&#x4E0A;&#x53F8;&#x7684;&#x4E0A;&#x53F8;&#x2026;&#x2026;&#x90FD;&#x53EF;&#x4EE5;&#x9080;&#x8BF7;&#xFF09;&#x3002; &#x9898;&#x76EE; &#x6BCF;&#x4E2A;&#x53C2;&#x52A0;&#x665A;&#x4F1A;&#x7684;&#x4EBA;&#x90FD;&#x80FD;&#x4E3A;&#x665A;&#x4F1A;&#x589E;&#x6DFB;&#x4E00;&#x4E9B;&#x6C14;&#x6C1B;&#xFF0C;&#x6C42;&#x4E00;&#x4E2A;&#x9080;&#x8BF7;&#x65B9;&#x6848;&#xFF0C;&#x4F7F;&#x6C14;&#x6C1B;&#x503C;&#x7684;&#x548C;&#x6700;&#x5927;&#x3002; &#x8F93;&#x5165;&#x683C;&#x5F0F; &#x7B2C;1&#x884C;&#x4E00;&#x4E2A;&#x6574;&#x6570;N&#xFF08;1&lt;=N&lt;=6000&#xFF09;&#x8868;&#x793A;&#x516C;&#x53F8;&#x7684;&#x4EBA;&#x6570;&#x3002; &#x63A5;&#x4E0B;&#x6765;N&#x884C;&#x6BCF;&#x884C;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x3002;&#x7B2C;i&#x884C;&#x7684;&#x6570;&#x8868;&#x793A;&#x7B2C;i&#x4E2A;&#x4EBA;&#x7684;&#x6C14;&#x6C1B;&#x503C;x(-128&lt;=x&lt;=127)&#x3002; &#x63A5;&#x4E0B;&#x6765;&#x6BCF;&#x884C;&#x4E24;&#x4E2A;&#x6574;&#x6570;L&#xFF0C;K&#x3002;&#x8868;&#x793A;&#x7B2C;K&#x4E2A;&#x4EBA;&#x662F;&#x7B2C;L&#x4E2A;&#x4EBA;&#x7684;&#x4E0A;&#x53F8;&#x3002; &#x8F93;&#x5165;&#x4EE5;0 0&#x7ED3;&#x675F;&#x3002; &#x8F93;&#x51FA;&#x683C;&#x5F0F; &#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x6C14;&#x6C1B;&#x503C;&#x548C;&#x3002; &#x6837;&#x4F8B;&#x8F93;&#x5165; 7 1 1 1 1 1 1 1 1 3 2 3 6 4 7 4 4 5 3 5 0 0 &#x6837;&#x4F8B;&#x8F93;&#x51FA; 5 <strong>&#x63D0;&#x4EA4;&#x5730;&#x5740;&#xFF1A;</strong> <a href="http://acm.timus.ru/submit.aspx?space=1&amp;num=1039" target="_blank" rel="noopener">http://acm.timus.ru/submit.aspx?space=1&amp;num=1039</a> <strong>&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x72B6;&#x6001;&#xFF1A;&#x6BCF;&#x4E2A;&#x7ED3;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x4E0D;&#x53C2;&#x4E0E;&#x805A;&#x4F1A;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x76F8;&#x90BB;&#x5B50;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x53C2;&#x52A0;&#x805A;&#x4F1A;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x53C2;&#x52A0;&#xFF1B;&#x4E00;&#x4E2A;&#x4EBA;&#x53C2;&#x4E0E;&#x805A;&#x4F1A;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x76F8;&#x90BB;&#x5B50;&#x8282;&#x70B9;&#x4E00;&#x5B9A;&#x4E0D;&#x80FD;&#x53C2;&#x4E0E;&#x805A;&#x4F1A;&#x3002;&#x6211;&#x4EEC;&#x52A0;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#xFF1A;&#x53C2;&#x4E0E;&#x6216;&#x8005;&#x4E0D;&#x53C2;&#x4E0E;&#x805A;&#x4F1A;&#x3002;</strong> <strong>dp[i][j]&#x8868;&#x793A;&#x7B2C;i&#x4E2A;&#x4EBA;&#x53C2;&#x4E0E;(j==1)&#x6216;&#x4E0D;&#x53C2;&#x4E0E;(j==0)&#x805A;&#x4F1A;&#x65F6;&#x805A;&#x4F1A;&#x6240;&#x80FD;&#x8FBE;&#x5230;&#x7684;&#x6700;&#x5927;&#x6C14;&#x6C1B;&#x503C;</strong></p>
<p>#include<cstdio><br>#include<cstring><br>#include<algorithm><br>using namespace std;<br>const int MAX=8000;<br>int w[MAX],f[MAX][2],l,k,rt;<br>int que[MAX],top,rear,father[MAX];<br>int first[MAX],nxt[MAX],go[MAX],arcnum;<br>void addarc(int a,int b){</algorithm></cstring></cstdio></p>
<pre><code>nxt[++arcnum]=first[a];
first[a]=arcnum;
go[arcnum]=b;
</code></pre><p>}</p>
<p>int main(){<br>//    freopen(&#x201C;in.txt&#x201D;,&#x201D;r&#x201D;,stdin);</p>
<pre><code>int n;
scanf(&quot;%d&quot;,&amp;n);
for(int i=1;i&lt;=n;i++)
    scanf(&quot;%d&quot;,&amp;w[i]);

while(scanf(&quot;%d%d&quot;,&amp;l,&amp;k)!=EOF&amp;&amp;l!=0&amp;&amp;k!=0){
    father[l]=k;
    addarc(k,l);
}
</code></pre><p>/*    for(int i=1;i&lt;=n;i++){</p>
<pre><code>    printf(&quot;%d &quot;,i);
    for(int p=first[i];p!=0;p=nxt[p]){
        int j=go[p];
        printf(&quot;%d &quot;,j);
    }
    printf(&quot;\n&quot;);
}printf(&quot;\n&quot;);*/
for(int i=1;i&lt;=n;i++)
    if(!father[i]){
        rt=i; break;
    }
que[rear++]=rt;
do{
    for(int p=first[que[top++]];p!=0;p=nxt[p])
        que[rear++]=go[p];
}while(top!=rear);

for(int k=top-1;k&gt;=0;k--){
    int i=que[k];
    if(first[i]==0){
        f[i][0]=0;
        f[i][1]=w[i];
    }else{
        int sum,j;
        sum=0;
        for(int p=first[i];p!=0;p=nxt[p]){
            j=go[p];
            sum+=max(f[j][0],f[j][1]);
        }
        f[i][0]=sum;
        sum=0;
        for(int p=first[i];p!=0;p=nxt[p]){
            j=go[p];
            sum+=f[j][0];
        }
        f[i][1]=sum+w[i];
    }
}
printf(&quot;%d&quot;,max(f[rt][0],f[rt][1]));
</code></pre></li>
</ol>
<pre><code>/*    printf(&quot;\n&quot;);
    for(int i=1;i&lt;=n;i++){
        printf(&quot;%d %d\n&quot;,f[i][0],f[i][1]);
    }*/


    return 0;
}
</code></pre><p><a class="magnific-img" href="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw=="><img src="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==" alt title="&#x70B9;&#x51FB;&#x5E76;&#x62D6;&#x62FD;&#x4EE5;&#x79FB;&#x52A8;" class="ui centered image"></a></p>
<p>POJ 1985 Cow Marathon &#x9898;&#x76EE;&#x5927;&#x610F; &#x6C42;&#x4E00;&#x68F5;&#x6811;&#x7684;&#x6700;&#x957F;&#x8DEF;&#x5F84; &#x8F93;&#x5165;&#xFF1A; &#x7B2C;&#x4E00;&#x884C;&#xFF1A;n,m (2 &lt;= N &lt;= 40,000,1 &lt;= M&lt; 40,000)&#xFF0C;&#x8868;&#x793A;&#x6709;n&#x4E2A;&#x8282;&#x70B9;&#xFF0C;m&#x6761;&#x8FB9; &#x63A5;&#x4E0B;&#x6765;m&#x884C;&#xFF1A; &#x6BCF;&#x884C;&#x56DB;&#x4E2A;&#x91CF;&#xFF1A;a b w c&#xFF0C;&#x8868;&#x793A;a&#x4E0E;b&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x6743;&#x503C;&#x4E3A;w&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x5C06;c&#x5FFD;&#x7565;&#x6389; &#x8F93;&#x51FA;&#xFF1A; &#x6700;&#x957F;&#x8DEF;&#x5F84;&#x957F;&#x5EA6; <strong>&#x6A21;&#x7248;&#x9898; &#x4F46;&#x662F;WA&#x4E86;&#xFF0C;&#x5C31;&#x4E0D;&#x7ED9;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x3002;&#x3002;&#x3002;</strong> <strong>Ural 1018 &#x4E8C;*&#x82F9;&#x679C;&#x6811;</strong> <strong>&#x9898;&#x76EE;</strong> &#x6709;&#x4E00;&#x68F5;&#x82F9;&#x679C;&#x6811;&#xFF0C;&#x5982;&#x679C;&#x6811;&#x679D;&#x6709;&#x5206;&#x53C9;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x5206;2&#x53C9;&#xFF08;&#x5C31;&#x662F;&#x8BF4;&#x6CA1;&#x6709;&#x53EA;&#x6709;1&#x4E2A;&#x513F;&#x5B50;&#x7684;&#x7ED3;&#x70B9;&#xFF09; &#x8FD9;&#x68F5;&#x6811;&#x5171;&#x6709;N&#x4E2A;&#x7ED3;&#x70B9;&#xFF08;&#x53F6;&#x5B50;&#x70B9;&#x6216;&#x8005;&#x6811;&#x679D;&#x5206;&#x53C9;&#x70B9;&#xFF09;&#xFF0C;&#x7F16;&#x53F7;&#x4E3A;1-N,&#x6811;&#x6839;&#x7F16;&#x53F7;&#x4E00;&#x5B9A;&#x662F;1&#x3002; &#x6211;&#x4EEC;&#x7528;&#x4E00;&#x6839;&#x6811;&#x679D;&#x4E24;&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x7ED3;&#x70B9;&#x7684;&#x7F16;&#x53F7;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x6839;&#x6811;&#x679D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x9897;&#x6709;4&#x4E2A;&#x6811;&#x679D;&#x7684;&#x6811; 2   5 \ / 3   4 \ / 1 &#x73B0;&#x5728;&#x8FD9;&#x9897;&#x6811;&#x679D;&#x6761;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x526A;&#x679D;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x6811;&#x679D;&#x4E0A;&#x957F;&#x6709;&#x82F9;&#x679C;&#x3002; &#x7ED9;&#x5B9A;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x7684;&#x6811;&#x679D;&#x6570;&#x91CF;&#xFF0C;&#x6C42;&#x51FA;&#x6700;&#x591A;&#x80FD;&#x7559;&#x4F4F;&#x591A;&#x5C11;&#x82F9;&#x679C;&#x3002; <strong>&#x8F93;&#x5165;&#x683C;&#x5F0F;</strong> &#x7B2C;1&#x884C;2&#x4E2A;&#x6570;&#xFF0C;N&#x548C;Q(1&lt;=Q&lt;=N,1&lt;N&lt;=100)&#x3002; N&#x8868;&#x793A;&#x6811;&#x7684;&#x7ED3;&#x70B9;&#x6570;&#xFF0C;Q&#x8868;&#x793A;&#x8981;&#x4FDD;&#x7559;&#x7684;&#x6811;&#x679D;&#x6570;&#x91CF;&#x3002;&#x63A5;&#x4E0B;&#x6765;N-1&#x884C;&#x63CF;&#x8FF0;&#x6811;&#x679D;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x6BCF;&#x884C;3&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x662F;&#x5B83;&#x8FDE;&#x63A5;&#x7684;&#x7ED3;&#x70B9;&#x7684;&#x7F16;&#x53F7;&#x3002;&#x7B2C;3&#x4E2A;&#x6570;&#x662F;&#x8FD9;&#x6839;&#x6811;&#x679D;&#x4E0A;&#x82F9;&#x679C;&#x7684;&#x6570;&#x91CF;&#x3002; &#x6BCF;&#x6839;&#x6811;&#x679D;&#x4E0A;&#x7684;&#x82F9;&#x679C;&#x4E0D;&#x8D85;&#x8FC7;30000&#x4E2A;&#x3002; <strong>&#x8F93;&#x51FA;&#x683C;&#x5F0F;</strong> &#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x6700;&#x591A;&#x80FD;&#x7559;&#x4F4F;&#x7684;&#x82F9;&#x679C;&#x7684;&#x6570;&#x91CF;&#x3002; <strong>&#x6837;&#x4F8B;&#x8F93;&#x5165;</strong> 5 2 1 3 1 1 4 10 2 3 20 3 5 20 <strong>&#x6837;&#x4F8B;&#x8F93;&#x51FA;</strong> 21 <strong>&#x72B6;&#x6001;&#xFF1A;&#x7ED3;&#x70B9;&#x3001;&#x6811;&#x6240;&#x4FDD;&#x7559;&#x7684;&#x6811;&#x679D;&#x6570;&#x91CF;&#x3002;</strong> <strong>f[i][j]&#x8868;&#x793A;&#x5728;&#x7B2C;i&#x4E2A;&#x7ED3;&#x70B9;&#x4EE5;&#x4E0B;&#x7684;&#x5B50;&#x6811;&#x4FDD;&#x7559;j&#x4E2A;&#x6811;&#x679D;&#x6240;&#x80FD;&#x4FDD;&#x7559;&#x7684;&#x6700;&#x5927;&#x82F9;&#x679C;&#x6570;</strong> <strong>&#x5206;&#x914D;&#x6811;&#x679D;&#x9700;&#x8981;&#x679A;&#x4E3E;&#x5206;&#x914D;&#x7ED9;&#x6574;&#x4E2A;&#x5B50;&#x6811;&#x7684;&#x6811;&#x679D;&#x6570;&#x3001;&#x518D;&#x679A;&#x4E3E;&#x5206;&#x7ED9;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x7684;&#x6811;&#x679D;&#x5404;&#x6709;&#x591A;&#x5C11;&#xFF0C;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x5206;&#x7ED9;&#x5DE6;&#x53F3;&#x5B50;&#x6811;&#x6811;&#x679D;&#x7684;&#x540C;&#x65F6;&#x4F1A;&#x635F;&#x5931;&#x6389;&#x4E24;&#x6839;&#x6811;&#x679D;</strong> </p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAX=1000;
int first[MAX],nxt[MAX],go[MAX],w[MAX][MAX],arcnum;
int f[MAX][MAX],father[MAX],lch[MAX],rch[MAX],vis[MAX];
int que[MAX],top,rear;
void addarc(int a,int b,int c){
    nxt[++arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum]=b;
    w[a][b]=c;
}
int main(){
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,q,a,b,c;
    scanf(&quot;%d%d&quot;,&amp;n,&amp;q);
    for(int i=1;i&lt;=n-1;i++){
        scanf(&quot;%d%d%d&quot;,&amp;a,&amp;b,&amp;c);
        addarc(a,b,c);
        addarc(b,a,c);
    }
    que[rear++]=1; vis[1]=1;
    do{
        int u=que[top++],v;
        for(int p=first[u];p!=0;p=nxt[p]){
            v=go[p];
            if(vis[v]) continue;
            if(!lch[u]) lch[u]=v;
            else rch[u]=v;
            que[rear++]=v; vis[v]=1;
        }
    }while(top!=rear);

    for(int k=top-1;k&gt;=0;k--){
        int i=que[k];
        if(!lch[i]) continue;
        for(int j=1;j&lt;=q;j++){//&#x5206;&#x914D;j&#x4E2A;&#x6811;&#x679D; 
            f[i][j]=max(f[i][j],max(f[lch[i]][j-1]+w[i][lch[i]],f[rch[i]][j-1]+w[i][rch[i]]));//&#x5355;&#x72EC;&#x5206;&#x914D; 
            for(int j0=1;j0&lt;j;j0++){//&#x4E24;&#x4E2A;&#x90FD;&#x5206;&#x914D; 
                int lw=f[lch[i]][j0-1]+w[i][lch[i]];
                int rw=f[rch[i]][j-j0-1]+w[i][rch[i]];
                f[i][j]=max(f[i][j],lw+rw);
            }
        }
    }
    printf(&quot;%d&quot;,f[1][q]);

    return 0;
}
</code></pre><p><a class="magnific-img" href="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw=="><img src="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==" alt title="&#x70B9;&#x51FB;&#x5E76;&#x62D6;&#x62FD;&#x4EE5;&#x79FB;&#x52A8;" class="ui centered image"></a></p>
<p> <strong>POJ1155&#x6709;&#x9650;&#x7535;&#x89C6;&#x7F51;&#x7EDC;</strong> &#x6709;&#x4E00;&#x68F5;N&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6811;&#xFF0C;&#x6811;&#x4E0A;&#x6709;M&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x5BF9;&#x5E94;M&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x5176;&#x4F59;&#x4E3A;&#x8F6C;&#x53D1;&#x7AD9;&#xFF0C;1&#x53F7;&#x8282;&#x70B9;&#x4E3A;&#x6839;&#xFF0C;&#x7535;&#x89C6;&#x53F0;&#x5728;1&#x53F7;&#x8282;&#x70B9;&#xFF0C;&#x8282;&#x76EE;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x4F20;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x90FD;&#x8981;&#x8D39;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x613F;&#x610F;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x94B1;&#x6765;&#x6536;&#x770B;&#x8282;&#x76EE;&#x3002;&#x6C42;&#x5728;&#x7535;&#x89C6;&#x53F0;&#x4E0D;&#x4E8F;&#x672C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6700;&#x591A;&#x5141;&#x8BB8;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7535;&#x89C6;&#x8282;&#x76EE;&#x3002; &#x89C4;&#x6A21;&#xFF1A; N&lt;=3000  M<n 输入： n m n表示转发站和用户总数，m为用户数 以下n-m行，第i行第一个k，表示转发站i和k个（转发站或用户）相连,其后第j对数val,cost表示，第i个转发站到val有边，费用cost. 最后一行m个数表示每个用户愿意负的钱。 输出： 不亏本前提下，可以收到节目最多的用户数。 （如果某个用户要收到节目（叶子结点），那么电视台到该用户的路径节点的费用都要付） 思路:在树上进行背包，对于以u为根的子树,该子树供给给j个用户亏本的最少钱 **此题用平常的思维一般会想到用f\[i\]\[j\]的i表示结点，j表示盈亏费用，f\[i\]\[j\]就刚好表示用户的数量，但是盈亏费用并不是一个很好的量，它的范围很大，即使用动态规划也会很耗时间，所以我们只能将f\[i,j\]表示在以i为根的树上允许j的用户数，最大能赚到（最少亏损）的钱** **在最后全部遍历一边，最先被发现f\[i\]\[j\]>=0&#x7684;i&#x5C31;&#x662F;&#x7B54;&#x6848;<strong>  </strong>&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x6839;&#x7ED3;&#x70B9;&#x6709;&#x591A;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x4E0D;&#x50CF;&#x4E8C;&#x53C9;&#x82F9;&#x679C;&#x6811;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x679A;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x7528;&#x5230;&#x4E00;&#x4E9B;01&#x80CC;&#x5305;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x6765;&#x6C42;&#x89E3;&#x8FD9;&#x4E2A;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x79FB;&#x65B9;&#x7A0B;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x770B;&#x4F5C;&#x7269;&#x54C1;&#xFF0C;&#x5206;&#x914D;&#x7684;&#x5219;&#x662F;&#x5BF9;&#x5E94;&#x7684;&#x7528;&#x6237;&#x6570;&#xFF0C;&#x80FD;&#x5728;&#x8F83;&#x5FEB;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6C42;&#x51FA;&#x72B6;&#x6001;**  </n></p>
<pre><code>#include&lt;cstdio&gt;
#include&lt;cstring&gt;
#include&lt;algorithm&gt;
using namespace std;
const int MAXN=3020;
const int MAXM=8000;
int first[MAXN],nxt[MAXM],go[MAXM],w[MAXM],arcnum;
int dp[MAXN][MAXN],sum[MAXN],temp[MAXN];
void addarc(int a,int b,int c){
    nxt[++arcnum]=first[a];
    first[a]=arcnum;
    go[arcnum]=b;
    w[arcnum]=c;
}

void DFS(int u){
    for(int p=first[u];p!=0;p=nxt[p]){
        int v=go[p];
        DFS(v);
        for(int j=0;j&lt;=sum[u];j++)
            temp[j]=dp[u][j];
        for(int j=0;j&lt;=sum[u];j++)
            for(int k=1;k&lt;=sum[v];k++)
                dp[u][k+j]=max(dp[u][k+j],temp[j]+dp[v][k]-w[p]);
        sum[u]+=sum[v];
    }
}

int main(){
//    freopen(&quot;in.txt&quot;,&quot;r&quot;,stdin);
    int n,m,b,c,t;
    scanf(&quot;%d%d&quot;,&amp;n,&amp;m);
    for(int i=1;i&lt;=n;i++){//&#x4E0D;&#x80FD;&#x7528;memset,&#x4F1A;&#x4F7F;&#x4E00;&#x4E2A;&#x6570;&#x8D1F;&#x5F97;&#x592A;&#x591A;&#x4ECE;&#x800C;&#x53D8;&#x6210;&#x6B63;&#x503C; 
          for(int j=1;j&lt;=m;j++)  
              dp[i][j]=-10000000;  
    }  
    for(int i=1;i&lt;=n-m;i++){
        scanf(&quot;%d&quot;,&amp;t);
        sum[i]=0;
        while(t--){
            scanf(&quot;%d%d&quot;,&amp;b,&amp;c);
            addarc(i,b,c);
        }
    }
    for(int i=n-m+1;i&lt;=n;i++){
        sum[i]=1;
        scanf(&quot;%d&quot;,&amp;dp[i][1]);
    }
    DFS(1);
    for(int i=m;i&gt;=0;i--)
        if(dp[1][i]&gt;=0){
            printf(&quot;%d&quot;,i);
            break;
        }

    return 0;
}
</code></pre><p><a class="magnific-img" href="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw=="><img src="data:image/gif;base64,R0lGODlhAQABAPABAP///wAAACH5BAEKAAAALAAAAAABAAEAAAICRAEAOw==" alt title="&#x70B9;&#x51FB;&#x5E76;&#x62D6;&#x62FD;&#x4EE5;&#x79FB;&#x52A8;" class="ui centered image"></a></p>
<h1 id="&#x5C71;&#x8D3C;&#x96C6;&#x56E2;"><a href="#&#x5C71;&#x8D3C;&#x96C6;&#x56E2;" class="headerlink" title="&#x5C71;&#x8D3C;&#x96C6;&#x56E2;"></a>&#x5C71;&#x8D3C;&#x96C6;&#x56E2;</h1><p>&#x65F6;&#x95F4;&#x9650;&#x5236;&#xFF1A;4s  &#x7A7A;&#x95F4;&#x9650;&#x5236;&#xFF1A;256MB &#x9898;&#x76EE;&#x63CF;&#x8FF0; &#x67D0;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x5728;&#x7EFF;&#x836B;&#x6751;&#x62E5;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x52BF;&#x529B;&#xFF0C;&#x6574;&#x4E2A;&#x7EFF;&#x836B;&#x6751;&#x7531;N&#x4E2A;&#x8FDE;&#x901A;&#x7684;&#x5C0F;&#x6751;&#x843D;&#x7EC4;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x8BC1;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E24;&#x4E2A;&#x5C0F;&#x6751;&#x843D;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x6761;&#x7B80;&#x5355;&#x8DEF;&#x5F84;&#x76F8;&#x8FDE;&#x3002;&#x5C0F;&#x6751;&#x843D;&#x7528;&#x963F;&#x62C9;&#x4F2F;&#x6570;&#x5B57;&#x7F16;&#x53F7;&#x4E3A;1,2,3,4,&#x2026;,n&#xFF0C;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x7684;&#x603B;&#x90E8;&#x8BBE;&#x5728;&#x7F16;&#x53F7;&#x4E3A;1&#x7684;&#x5C0F;&#x6751;&#x843D;&#x4E2D;&#x3002;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x9664;&#x4E86;&#x8001;&#x5927;&#x5750;&#x9547;&#x603B;&#x90E8;&#x4EE5;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x7684;P&#x4E2A;&#x90E8;&#x95E8;&#x5E0C;&#x671B;&#x5728;&#x6751;&#x843D;&#x7684;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x5EFA;&#x7ACB;&#x5206;&#x90E8;&#x3002;P&#x4E2A;&#x5206;&#x90E8;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5C0F;&#x6751;&#x843D;&#x4E2D;&#x5EFA;&#x8BBE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x5EFA;&#x8BBE;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5C0F;&#x6751;&#x843D;&#x4E2D;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x90E8;&#x5230;&#x603B;&#x90E8;&#x7684;&#x8DEF;&#x5F84;&#x79F0;&#x4E3A;&#x8FD9;&#x4E2A;&#x90E8;&#x95E8;&#x7684;&#x7BA1;&#x8F96;&#x8303;&#x56F4;&#xFF0C;&#x4E8E;&#x662F;&#x8FD9;P&#x4E2A;&#x5206;&#x90E8;&#x7684;&#x7BA1;&#x8F96;&#x8303;&#x56F4;&#x53EF;&#x80FD;&#x91CD;&#x53E0;&#xFF0C;&#x6216;&#x8005;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6751;&#x843D;&#x5EFA;&#x8BBE;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x90E8;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x4E0D;&#x540C;&#x7684;&#x8D39;&#x7528;&#x3002;&#x6BCF;&#x4E2A;&#x90E8;&#x95E8;&#x53EF;&#x80FD;&#x5BF9;&#x4ED6;&#x7684;&#x7BA1;&#x8F96;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5C0F;&#x6751;&#x843D;&#x6536;&#x53D6;&#x4FDD;&#x62A4;&#x8D39;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x90E8;&#x5982;&#x679C;&#x5BF9;&#x540C;&#x4E00;&#x5C0F;&#x6751;&#x843D;&#x540C;&#x65F6;&#x6536;&#x53D6;&#x4FDD;&#x62A4;&#x8D39;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x77DB;&#x76FE;&#xFF0C;&#x4ECE;&#x800C;&#x635F;&#x5931;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x5229;&#x76CA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x53EF;&#x80FD;&#x76F8;&#x4E92;&#x5408;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x7684;&#x5229;&#x76CA;&#x3002;&#x73B0;&#x5728;&#x8BF7;&#x4F60;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x786E;&#x5B9A;P&#x4E2A;&#x5206;&#x90E8;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F7F;&#x5F97;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x7684;&#x6536;&#x76CA;&#x3002; &#x8F93;&#x5165;&#x683C;&#x5F0F;(cateran.in) &#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7B2C;&#x4E00;&#x884C;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6574;&#x6570;N&#x548C;P&#xFF0C;&#x8868;&#x793A;&#x7EFF;&#x836B;&#x6751;&#x5C0F;&#x6751;&#x843D;&#x7684;&#x6570;&#x91CF;&#x4EE5;&#x53CA;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x7684;&#x90E8;&#x95E8;&#x6570;&#x91CF;&#x3002; &#x63A5;&#x4E0B;&#x6765;N-1&#x884C;&#x6BCF;&#x884C;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6574;&#x6570;X&#x548C;Y&#xFF0C;&#x8868;&#x793A;&#x7F16;&#x53F7;&#x4E3A;X&#x7684;&#x6751;&#x843D;&#x4E0E;&#x7F16;&#x53F7;&#x4E3A;Y&#x7684;&#x6751;&#x843D;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x9053;&#x8DEF;&#x76F8;&#x8FDE;&#x3002;(1&lt;=X,Y&lt;=N) &#x63A5;&#x4E0B;&#x6765;N&#x884C;&#xFF0C;&#x6BCF;&#x884C;P&#x4E2A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x7B2C;i&#x884C;&#x7B2C;j&#x4E2A;&#x6570;&#x8868;&#x793A;&#x5728;&#x7B2C;i&#x4E2A;&#x6751;&#x843D;&#x5EFA;&#x8BBE;&#x7B2C;j&#x4E2A;&#x90E8;&#x95E8;&#x7684;&#x5206;&#x90E8;&#x7684;&#x82B1;&#x8D39;Aij&#x3002; &#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x6574;&#x6570;T&#xFF0C;&#x8868;&#x793A;&#x4E0B;&#x9762;&#x6709;T&#x884C;&#x5173;&#x4E8E;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x7684;&#x5206;&#x90E8;&#x95E8;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x7684;&#x4EE3;&#x4EF7;&#x3002;(0&lt;=T&lt;=2p) &#x6700;&#x540E;&#x6709;T&#x884C;&#xFF0C;&#x6BCF;&#x884C;&#x6700;&#x5F00;&#x59CB;&#x6709;&#x4E00;&#x4E2A;&#x6570;V&#xFF0C;&#x5982;&#x679C;V&#x4E3A;&#x6B63;&#xFF0C;&#x8868;&#x793A;&#x4F1A;&#x83B7;&#x5F97;&#x989D;&#x5916;&#x7684;&#x6536;&#x76CA;&#xFF0C;&#x5982;&#x679C;V&#x4E3A;&#x8D1F;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x4F1A;&#x635F;&#x5931;&#x4E00;&#x5B9A;&#x7684;&#x6536;&#x76CA;&#x3002;&#x7136;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x6574;&#x6570;C&#xFF0C;&#x8868;&#x793A;&#x672C;&#x63CF;&#x8FF0;&#x6D89;&#x53CA;&#x7684;&#x5206;&#x90E8;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6709;C&#x4E2A;&#x6570;&#xFF0C;Xi&#xFF0C;&#x4E3A;&#x5206;&#x90E8;&#x95E8;&#x7684;&#x7F16;&#x53F7;(Xi&#x4E0D;&#x80FD;&#x76F8;&#x540C;)&#x3002;&#x8868;&#x793A;&#x5982;&#x679C;C&#x4E2A;&#x5206;&#x90E8;Xi&#x540C;&#x65F6;&#x7BA1;&#x8F96;&#x67D0;&#x4E2A;&#x5C0F;&#x6751;&#x843D;&#xFF08;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x5176;&#x4ED6;&#x5206;&#x90E8;&#x4E5F;&#x7BA1;&#x8F96;&#x8FD9;&#x4E2A;&#x5C0F;&#x6751;&#x843D;&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x83B7;&#x5F97;&#x7684;&#x989D;&#x5916;&#x6536;&#x76CA;&#x6216;&#x8005;&#x635F;&#x5931;&#x7684;&#x6536;&#x76CA;&#x4E3A;&#x7684;|V|&#x3002;T&#x884C;&#x4E2D;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x76F8;&#x540C;&#x7684;Xi&#x96C6;&#x5408;&#xFF0C;&#x8868;&#x793A;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x51E0;&#x79CD;&#x6536;&#x76CA;&#x6216;&#x8005;&#x635F;&#x5931;&#x3002; &#x8F93;&#x51FA;&#x683C;&#x5F0F;(cateran.out) &#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x8981;&#x6C42;&#x7B2C;&#x4E00;&#x884C;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6570;Ans&#xFF0C;&#x8868;&#x793A;&#x5C71;&#x8D3C;&#x96C6;&#x56E2;&#x8BBE;&#x7F6E;&#x6240;&#x6709;&#x5206;&#x90E8;&#x540E;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x7684;&#x6700;&#x5927;&#x6536;&#x76CA;&#x3002; &#x6837;&#x4F8B;&#x6570;&#x636E;</p>
<p>&#x8F93;&#x5165;&#x6837;&#x4F8B;</p>
<p>&#x8F93;&#x51FA;&#x6837;&#x4F8B;</p>
<p>2 1 1 2 2 1 1 3 1 1</p>
<p>5</p>
<p>&#x6570;&#x636E;&#x89C4;&#x6A21; &#x5BF9;&#x4E8E;40%&#x7684;&#x6570;&#x636E;&#xFF0C;1&lt;=P&lt;=6&#x3002; &#x5BF9;&#x4E8E;100%&#x7684;&#x6570;&#x636E;&#xFF0C;1&lt;=N&lt;=100&#xFF0C;1&lt;=P&lt;=12&#xFF0C;&#x4FDD;&#x8BC1;&#x7B54;&#x6848;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x4E0D;&#x8D85;&#x8FC7;108&#x3002;  <strong>&#x9898;&#x76EE;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x96BE;&#x5728;&#x50A8;&#x5B58;&#x5404;&#x4E2A;&#x4E0D;&#x540C;&#x5206;&#x90E8;&#x7684;&#x5206;&#x914D;&#x65B9;&#x6CD5;&#x4E0A;&#xFF0C;&#x524D;&#x6587;&#x8BB2;&#x5230;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x538B;&#x7F29;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x4E00;&#x79CD;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x6CD5;&#xFF1A;</strong> <strong>for(int j&#x2019;= j ;j&#x2019;&gt;=0;j&#x2019;=(j&#x2019;-1)&amp;j){</strong> <strong>}</strong> <strong>&#x5176;&#x4E2D;&#x7684;j&#x2019;&#x5C31;&#x662F;j&#x65B9;&#x6848;&#x7684;&#x4E00;&#x4E2A;&#x8865;&#x96C6;&#xFF0C;&#x53CD;&#x590D;&#x5FAA;&#x73AF;&#xFF0C;&#x76F4;&#x5230;&#x904D;&#x5386;&#x5230;&#x7A7A;&#x96C6;&#x624D;&#x7ED3;&#x675F;</strong>  <strong>&#x5982;00010011&#x8868;&#x793A;&#x9009;4&#x3001;7&#x3001;8&#x5206;&#x90E8;</strong> <strong>&#x5219;&#x5B83;&#x7684;&#x8865;&#x96C6;&#x4E3A;&#xFF1A;</strong> <strong>S1=00010010&amp;00010011=00010010  4&#x3001;7&#x5206;&#x90E8;</strong> <strong>S2=00010001&amp;00010011=00010001   4&#x3001;8&#x5206;&#x90E8;</strong> <strong>S3=00010000&amp;00010011=00010000   4&#x5206;&#x90E8;</strong> <strong>S4=00001111&amp;00010011=00000011  7&#x3001;8&#x5206;&#x90E8;</strong> <strong>S5=00000010&amp;00010011=00000010  7&#x5206;&#x90E8;</strong> <strong>S6=00000001&amp;00010011=00000001  8&#x5206;&#x90E8;</strong> <strong>S7=00000000&amp;00010011=0          </strong></p>

                        
                    </div>

                    
                    
                    

                    <div class="description post-description">
    <span class="post-description-item">
        <time datetime="2018-12-06T15:45:21.000Z" itemprop="datePublished">2018-12-06</time>

    </span>
    <span class="post-description-item">
        
    </span>
</div>

                </div>
                
                <div id="pagination" class="nav-web ui text container pagination">

    <div class="ui stackable two column divided grid container">
        <div class="row">
            <div class="column nav-left">
                

                <a href="/2018/12/06/e5-ad-97-e5-85-b8-e6-a0-91-e6-80-bb-e7-bb-93/" class="ui tiny button">

                    <i class="angle left icon"></i>
                    
                    字典树总结
                    

                </a>

                
            </div>
            <div class="column nav-right">
                

                <a href="/2018/12/06/e5-8f-af-e5-b9-b6-e5-a0-86-e4-b9-8b-e5-b7-a6-e5-81-8f-e6-a0-91-e6-80-bb-e7-bb-93/" class="ui tiny button">
                    
                    可并堆之左偏树总结
                    
                    <i class="angle right icon"></i></a>
                
            </div>
        </div>
    </div>

</div>
                
            </div>

            
            <div class="three wide computer three wide tablet column">

                <div class="ui sticky article-toc" id="article-toc">
                    <!-- toc -->
                    <ol class="ui ordered list"><li><a href="#树形动规总结"><span>树形动规总结</span></a></li><li><a href="#山贼集团"><span>山贼集团</span></a></li></ol>
                </div>

            </div>
            

        </div>
    </div>
</div>


                    <!--</div>-->
                <!--</div>-->
            <!--</div>-->
        </div>
        <div class="ui vertical footer segment">
    <div class="ui center aligned container">
        <div class="ui inverted section divider"></div>
        &copy; 2019 <a href="/">mrh929</a>,
        Powered by <a href="https://github.com/henryhuang/hexo-theme-aloha" target="_blank">Aloha</a> and <a href="http://hexo.io/" target="_blank">Hexo</a>.
    </div>
</div>

    </div>




<!-- scripts list from theme config.yml -->

<script src="//cdn.bootcss.com/jquery/3.1.0/jquery.min.js"></script>

<script src="//cdn.bootcss.com/semantic-ui/2.2.4/semantic.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch/3.18.1/algoliasearch.min.js"></script>

<script src="//cdn.bootcss.com/algoliasearch-helper-js/2.13.0/algoliasearch.helper.min.js"></script>

<script src="/js/semantic-ui-algolia.js"></script>

<script src="/js/aloha-events.js"></script>



</body>
</html>
